[{"id":"7636250955","version":"2.6.19","date":"2021-07-30T18:01:42.000Z","authorName":"w2!?","rating":3,"title":"Barely works!","body":"Have had the app for a while, and it barely works! Takes too long to lock/ unlock. Also the remote start keeps saying unable to start due to a technical issue on MB end! Why am I paying for useless services? This is unacceptable for MB!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7609037830","version":"2.6.19","date":"2021-07-23T13:40:37.000Z","authorName":"Cute & bubbly","rating":3,"title":"A Bit Annoyed","body":"I love the app to pay my car note but when I want to start my car there always seems to be a problem! For Mercedes being such a high end vehicle, the app is very disappointing!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7598424063","version":"2.6.19","date":"2021-07-20T16:07:19.000Z","authorName":"Hsbbba","rating":3,"title":"Lacks Functionality","body":"Overall an OK app but lacks functionality that shows an almost mind numbing disconnect from the real world the developers must have. \n\nRemote start takes forever\n\nNo function to retrieve basic data such as tire pressure or vehicle mileage\n\nThe avatar is a greyed out silhouette of a generic 4D sedan- why can’t the app recognize from the VIN the model and color of my vehicle and automatically create an appropriate avatar. Not a life or death issue obviously but this shows an extreme lack of insight on the app developers’ part.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7591976679","version":"2.6.19","date":"2021-07-18T22:08:51.000Z","authorName":"Lambaroosky","rating":3,"title":"CONTINUED DEGRADATION OF APP-valet protect&geofencing alerts defunct, can’t locate vehicle,etc","body":"July 18, 2021 - Mercedes’ app had redeemed itself for a while. I updated the app to their most current version this morning for iOS (iPhone) and yet again, it fails to alert me when the ignition is started on valet protect. This feature is beyond critical to me and I sincerely hope that their IT people are reading the reviews so that they can address this recurrent issue. Come on Mercedes - if you were able to get it right before - you can rectify and get it right again! Please! \n\nJune 10, 2020 - it has now been a whopping 53 days that the app has NOT been able to locate my vehicle. My vehicle has remained in my garage (of which, the garage has WiFi connection indoors). In addition, the engine was turned on today. Yet again, the app FAILED to inform me that IGNITION was turned on (I have valet settings on at ALL times to alert of every single option regarding of car’s whereabouts and actions). I’m EXTREMELY DISAPPOINTED that this app is SO UNSTABLE and INCONSISTENT!! April 27, 2020 most recent App (4.5.2?): For a while the problems I outlined below - they were inexplicably, and to my great satisfaction, resolved. As of today and after updating the app last evening: the vehicle on the home page is the WRONG COLOR and it NO LONGER shows/states that the model of my car is a CABRIOLET. The app also CANNOT LOCATE MY VEHICLE. THIS ISSUE HAS BEEN ENSUING FOR THE LAST 10 DAYS. My car in my garage, but the app for whatever reason ISN’T LOCATING IT. KINDLY FIX!! WHAT THE HECK IS GOING ON WITH THIS APP?? IT WENT FROM BEING SOMEWHAT UNRELIABLE TO SHOCKINGLY BAD INTO THE ABYSS OF SHARP DECLINE OVER THE PAST TWO MONTHS STRAIGHT WHERE THIS APP IS CURRENTLY RENDERED USELESS!! TO THE DEVELOPERS: YOUR DEFUNCT APP IS CERTAINLY NOT CONVEYING HOW TRULY “SORRY” YOU ARE FOR THE LITANY OF “INCONVENIENCES” INCURRED BY ALL OF MB’s RIGHTFULLY OUTRAGED CLIENTELE!! WHAT WILL IT TAKE FOR MB TO FIX ANY, LET ALONE, ALL OF THE PROBLEMS PAINSTAKINGLY OUTLINED IN MY MULTIPLE REVIEWS AND EVERYONE ELSE’s?!? I LOVE MY CAR, BUT I LOATHE THE TOLL OF ENDLESS STRESS THAT THIS APP IS DOLING OUT. SIMPLY PUT THIS APP IS EGREGIOUS ~ PLEASE FIX IT, WITHOUT FURTHER DELAY!!! Nov 19, 2019 - I downloaded the newest version of this app update. Had high hopes that my below complaints may finally have been addressed, but sadly NO. Valet protection still does NOT FUNCTION!!! MB, what exactly did you fix in the latest version??? REVISION TO MY COMPLAINTS BELOW: A few days ago, Mercedes Me app forced me to login in (despite having the app set to “remember” me and despite there being NO recent app update release since one month ago). ALL of my below COMPLAINTS STILL EXIST. The enumerated EGREGIOUS matters that I’ve been incurring - well, they now have become EXPONENTIALLY WORSE. After logging back in all over again, I was affronted to see that the app RECENTLY WIPED OUT ALL OF MY PERSONAL SETTINGS (which I was compelled to renter) and suddenly the PHOTO (which appears on home screen of app) is now THE WRONG COLOR OF MY VEHICLE!! I wholeheartedly CONCUR with the LITANY of complaints that other reviewers have diligently pointed out - THE APP TAKES FOREVER TO OPEN (that’s IF it is willing to be responsive) AND NONE OF THE FEATURES FUNCTION ON THIS APP!! I AM FUMINGLY LIVID AT MERCEDES FOR PROVIDING THEIR CUSTOMERS WITH AN UNRELIABLE, UNRESPONSIVE, INACCURATE PIECE OF JUNK APP WHICH FAR EXCEEDS THE COMPANY AS A WHOLE GOING BEYOND THE PAIL OF EXUDING UTTER LACK OF RESPECT TO THEIR CLIENTELE!!! WHY ISN'T MERCEDES’ I.T. DEPT RACING FIX THEIR DEADBEAT APP??? Ever since I downloaded MB’s most recent app update on my iPhone, the feature (to alert me by text message) whenever my vehicle’s ignition gets turned on is NO LONGER notifying me. I have repeatedly logged into the app to make sure that this feature is “ACTIVATED & ON.” This feature was working before the last app update. It is critical to me that MB rectifies this problem. PLEASE FIX!! Thank you. **UPDATE ON ABOVE REVIEW (1 DAY LATER): For NO APPARENT REASON, MB’s app is turning my settings from ON to OFF! Why?!? Even after I have reactivated the setting back to ON the app is still NOT sending me any notification/text message when the IGNITION on my MB is turned on. WHY?!? I have never once altered my personal settings on this app - it is MB’s APP which is SOLELY RESPONSIBLE FOR CAUSING THIS RECURRENT ERROR/FAILURE!! I will repeat, THIS FEATURE THAT IS TO ALERT ME WHENEVER MY VEHICLE’S IGNITION IS TURNED ON IS EXTREMELY CRITICAL TO ME!! Please Fix!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7588992063","version":"2.6.19","date":"2021-07-18T03:17:01.000Z","authorName":"well pricing","rating":2,"title":"Inconsistent","body":"Love the Thought of It! Unfortunately it doesn’t correctly monitor my vehicle. The location monitoring is ALWAYS 8hrs to 24hrs behind. The unlock has Never worked, perhaps that is a good thing; since it’s GPS location is a full day late! The geo-fence appears to work while driving. Various preps have attempted to enter my Mercedes Benz; unsuccessfully thank God. Problem was I never received any Alerts. You would think that I would have.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7585333727","version":"2.6.19","date":"2021-07-17T03:31:00.000Z","authorName":"The DJ Platypus","rating":1,"title":"Why Was My EV supported and Now Not?","body":"I would be in absolute love with this app had I not been the unfortunate purchaser of a b250e where MBUSA decided to End of Life The EV Part of The App! What manufacturer does something like this? Was it really truly that difficult to maintain the connection with a few thousand owners b250e charge, charger locations, MPkWh, Etc? To be completely honest I feel really let down with the purchase of my first Mercedes. I understand the limited production of this vehicle that includes a third party (Tesla) Engine snd Drivetrain but ending the support of your first US EV? Why the car is completely capable of reporting the data when polled at any time. The Communications Module. Is LTE so that is definitely still supported. mBrace works fine in fact the 2019 has the same Telematics unit I believe and is MercedesMe Connect Enabled. Just feel very let down by a manufacturer I have lived since a child.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7558570300","version":"2.6.18","date":"2021-07-09T23:16:09.000Z","authorName":"0000rc","rating":1,"title":"Remote start is a joke","body":"Remote start never actually works- pointless and frustrating!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7558388825","version":"2.6.18","date":"2021-07-09T21:54:29.000Z","authorName":"Doug with deleted review","rating":1,"title":"Worst remote start of any car I’ve owned","body":"This app is a constant problem. Why is it so poorly engineered? My other cars remote start from the key fob not a glitchy app. I’ll bet our can starts less than 25% of the time. Plus, we’ve made many visits to the dealership for this.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7548897398","version":"2.6.18","date":"2021-07-07T10:29:10.000Z","authorName":"Enthusiast 38","rating":1,"title":"Mercedes Me","body":"95% of the time it doesn’t work.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7541837964","version":"2.6.18","date":"2021-07-05T13:27:35.000Z","authorName":"JitenMayi","rating":1,"title":"Useless for remote start.","body":"In the last 5 years that I have owned the vehicle, tried to start numerous times but worked only 3-4 times max. It certainly is a moody feature. 🙄","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7530747064","version":"2.6.18","date":"2021-07-02T12:59:02.000Z","authorName":"freezing cold 1","rating":1,"title":"Disappointed","body":"I expect Mercedes to offer top notch service. The app is not reliable; I can not count on it to work when I need it. It distresses me to have to pay for features that work some of the time, with no SLA to work all of the time. This hurts the Mercedes brand; you can do better.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7520149723","version":"2.6.18","date":"2021-06-29T18:28:22.000Z","authorName":"Benz 2020","rating":5,"title":"Benz2020","body":"Ty for being there and working with me to get in a better position You are what you represent Mercedes Benz it speak Value !!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7519814272","version":"2.6.18","date":"2021-06-29T16:30:58.000Z","authorName":"Joseph Carson","rating":3,"title":"Good app but wish the remote start and lock/unlock features will better","body":"I can’t seem to get past the fact that the vehicle turns off after you remote the vehicle when you unlock the vehicle to get in. Plus these features have an extremely delay in activating.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7512913609","version":"2.6.18","date":"2021-06-27T19:32:31.000Z","authorName":"Stinky9127","rating":1,"title":"Worst app I use","body":"For the expense of this car the app should work!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7512772039","version":"2.6.18","date":"2021-06-27T18:35:56.000Z","authorName":"i will buy a diffent brand","rating":1,"title":"Useless app","body":"It’s a useless app. Tech is late 1990s. I would not recommended if you are under 60 years old.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7502270757","version":"2.6.18","date":"2021-06-24T23:14:19.000Z","authorName":"Rodtrellius","rating":5,"title":"Awesome App! A must have if you own a Mercedes!","body":"Love this app so much! Who needs a Remote start key fob when you can use it through your phone. Love that’s I can track,locate, start, lock/unlock, and alert my Mercedes anywhere in the world! So convenient for me! There are so many other features that I did not mention! Awesome app!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7502210395","version":"2.6.18","date":"2021-06-24T22:46:18.000Z","authorName":"pychoup","rating":4,"title":"Remote start","body":"Car can not start remotely all the time.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7453890065","version":"2.6.18","date":"2021-06-11T22:33:59.000Z","authorName":"Tiphboo","rating":5,"title":"❤️❤️","body":"I’m loving the app so far…","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7450314865","version":"2.6.18","date":"2021-06-10T23:31:09.000Z","authorName":"rabz9","rating":1,"title":"They charge for what others give for free.","body":"I was scammed out of 2 years as they double billed me because of a some hidden 90 day trial for monthly services that my 2014 model did not even have. Refused to refund me. \n\n My new 2021 BMW (after this scam I wont buy another Mercedes). Has these features for FREE. Shame on you Mercedes.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7429343283","version":"2.6.18","date":"2021-06-05T12:33:36.000Z","authorName":"usakera","rating":5,"title":"Very useful","body":"I can start my car remotely,  it ia amazing and also can keep track of my financials, add Sirus XM and many more features...  locate the car is also very precise and awsome..","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7407149352","version":"2.6.18","date":"2021-05-30T19:02:35.000Z","authorName":"Misspiggy1908","rating":4,"title":"Love this app","body":"I had my car for 3 years. The app for 3 years. In the winter I used it often to warm up my car. If I’m running into the store for something, I’d use this app to lock my doors. It did have glitches at times. Sometimes it was unreliable but I think it had a lot to do with my battery level. Once I replaced it things went back to working properly. I wish the functionality allowed for smart watch capabilities. The app appears on my watch but I can’t access any functions.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7399505155","version":"2.6.18","date":"2021-05-28T20:07:18.000Z","authorName":"Sgmatt111","rating":1,"title":"Still terrible after several years","body":"Remote start works less than half the time. Been that way for years.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7388119226","version":"2.6.17","date":"2021-05-25T21:36:21.000Z","authorName":"Beshaa","rating":1,"title":"Remote Start Fail","body":"The remote start function doesn’t work. You managed to ruin technology that has existed for 30 years. How hard is this?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7387657196","version":"2.6.17","date":"2021-05-25T18:45:05.000Z","authorName":"Crowdes","rating":1,"title":"The worst app and feature I can imagine","body":"Being able to remote start was a major must-have when I was looking for a new car and this feature completely fails with Mercedes. I was skeptical about an app to begin with, and I was right to be. Remote start works at best 10-15% of the time, all the rest there’s some stupid response like “your windows are down” (when they aren’t) or better yet “remote start is down for maintenance. What a joke for a car that costs this much. Mercedes, take a page from Volvo’s book, or even Volkswagen, and create an app and remote start that actually function.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7383847356","version":"2.6.17","date":"2021-05-24T20:43:50.000Z","authorName":"Suenametakenz","rating":1,"title":"Annoying annoying","body":"Im in the parking lot alone and I want to open the car door with my phone. Husband has key inside mall. I can’t use the app be cause of a required update. Complete nonsense. 😣","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7383488193","version":"2.6.16","date":"2021-05-24T18:37:51.000Z","authorName":"Ben1465","rating":3,"title":"No Apple watch watch support for 2019 or newer models","body":"In app description Apple watch supported only with 2018 and prior models.\nApp works fine, but very disappointed over no apple watch support in 2019 or newer models.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7383445621","version":"2.6.16","date":"2021-05-24T18:23:43.000Z","authorName":"Not happyy","rating":1,"title":"Couldn’t do better","body":"I expected a better app from Mercedes Benz, it’s horrible.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7382869193","version":"2.6.16","date":"2021-05-24T15:29:16.000Z","authorName":"sherri np","rating":1,"title":"Hate it","body":"I hate this New app. Every time I sign in I have to change my password it’s very not user-friendly I don’t like it it’s not nearly as efficient as the prior app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7378022257","version":"2.6.16","date":"2021-05-23T11:58:18.000Z","authorName":"Bryant0422","rating":5,"title":"Getting better","body":"Updating my review.   Things are getting better.   Locking when starting now is a major improvement and multi-car support works great.   I LOVE the integration with the Apple Watch, pretty impressive to start my car from my watch!    Keep making improvements please.  We love toys with our cars.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7368993612","version":"2.6.16","date":"2021-05-21T07:28:11.000Z","authorName":"jaypan22","rating":1,"title":"Hard to paid.","body":"The older one app is better than this.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7361065219","version":"2.6.16","date":"2021-05-19T14:12:09.000Z","authorName":"Mpeare","rating":5,"title":"Great App","body":"I use this app to pay my monthly loan, send addresses to my car, start the auto remotely and lookup information about my C300. It’s all you can ask for!  Fabulous!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7353886760","version":"2.6.16","date":"2021-05-18T04:34:22.000Z","authorName":"a blessing and curse","rating":5,"title":"Mercedes me","body":"I only use it for payments. It’s fine","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7350484838","version":"2.6.16","date":"2021-05-17T12:51:04.000Z","authorName":"CJ6305","rating":5,"title":"Best app","body":"User friendly and provide current information","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7347307796","version":"2.6.16","date":"2021-05-16T19:15:04.000Z","authorName":"dutinda","rating":1,"title":"My car is red","body":"Please update this app to reflect my car. My car is red not white it’s irritating","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7346842224","version":"2.6.16","date":"2021-05-16T16:50:41.000Z","authorName":"Vbridgefor","rating":1,"title":"Ridiculousness","body":"Why would you require someone pays for an app that they’re paying a car for that should be a courtesy to be able to use I think that y’all need to rethink the way you have this set up because once the subscription goes out you no longer able to pay your bill on the app just dumb","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7333884208","version":"2.6.16","date":"2021-05-13T14:43:54.000Z","authorName":"!McMuffin!","rating":4,"title":"Simple And Great","body":"The App Is Awesome And Works Great. The Only Problem I’d Say About It Is The Auto Start In The Winter, 10mins Isn’t Much Time So You’d Have To Auto Start It More Then Once To Completely Warm Your Car. Other Than That This App Is A Life Saver.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7321138931","version":"2.6.16","date":"2021-05-10T11:27:33.000Z","authorName":"Aljst","rating":1,"title":"Great Car LOUSY App","body":"The app is very slow. Sometimes takes minutes to open. Remote start works very seldom and most times after watching it go around for several minutes it fails. \nDisappointing MB would have such crappy product. Old app worked much better. Hope MB creates a better app.\n*Update* The mew version is just as bad. Hard to believe that such a high line car would have such a BAD app. Now they took away the ability to honk to find the car on a parking lot. Of course plenty of marketing and ways to make payments are there which are really secondary to the purpose of the app. SHAME ON YOU Mercedes !","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7305363779","version":"2.6.16","date":"2021-05-06T16:27:13.000Z","authorName":"$$$ moneymaker","rating":5,"title":"Great","body":"Easy to use all your information at your fingertips","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7302976202","version":"2.6.16","date":"2021-05-06T00:53:17.000Z","authorName":"bigfoot 1","rating":1,"title":"Face ID does not work.","body":"Apps slow. Previous app was better. It is worse now. Your team needs to fix it. Mercedes has lost sight of quality.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7291243574","version":"2.6.16","date":"2021-05-03T01:33:53.000Z","authorName":"Rsevinor","rating":1,"title":"Review","body":"Old outdated and finicky just like Mercedes telematics and poor audio quality. S class cab audio is terrible    Not renewing","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7284384047","version":"2.6.16","date":"2021-05-01T10:00:12.000Z","authorName":"kenl12131212","rating":1,"title":"No car status","body":"Would be nice if the app able to give car status like door open/closed and engine started, etc","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7278093609","version":"2.6.16","date":"2021-04-29T18:28:26.000Z","authorName":"8836894d","rating":1,"title":"Who’s getting paid to write the positive reviews.","body":"Ha, that’s easy. All the MB support people who bristle at disturbing then when you call.\n\nOk, back to the ranch. This app is terrible. The remote start works 50% of the time, IF IF IF, the app isn’t offline for “updates”. There is one part of the app that has worked consistently... making a payment. Funny, huh? \n\nMy GMC app acts better, and the support people aren’t “put out”.\nHa, an app for my $50k truck works better than the one for my S63. Explain that....","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7265044365","version":"2.6.16","date":"2021-04-26T05:54:33.000Z","authorName":"ron the goat","rating":5,"title":"Love the app","body":"I actually love this app a lot it makes having a Mercedes Benz so much more Luxury. I mean we lay enough for the car so it’s cool they added this my favorite thing about it is probably the start the car just by telling Siri feature they added it’s a real show out move lol all my boys and the ladies were with love it 🤣🤣 it’s dope u can set ur temperature to only thing I don’t like the car turns off when u get it in it I think that’s kinda stupid. Y’all should fix that other then that dope feature.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7264508340","version":"2.6.16","date":"2021-04-26T01:39:43.000Z","authorName":"Mammamcfadden","rating":1,"title":"The worst ap ever","body":"I’ve literally been waiting for FOUR years for the  AP to work. The remote start still fails 80% of the time and most definitely when it’s snowing! It’s easy to navigate but just doesn’t work.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7264038796","version":"2.6.16","date":"2021-04-25T22:24:44.000Z","authorName":"Tbondo19","rating":1,"title":"The best or nothing... this app chose “nothing”","body":"Remote start fails 75% of the time for no good reason. I understand there’s parameters, like “doors need to be locked” (intuitive idea: offer to lock doors automatically and try again), or there needs to be at least 5 gallons of gas in the tank to auto-start (although 5 gallons seems excessive since the engine only runs on idle for 10 mins which doesn’t even use 1/10th of a gallon), so this is all a fail, but the most annoying of all is when an update to the app is mandated to continue using and you need to re-enter username and password. Loser-ville, the Mercedes app, and that’s unfortunate bc it seems like such an easy win.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7259352228","version":"2.6.15","date":"2021-04-24T17:13:41.000Z","authorName":"Ratu802","rating":5,"title":"More features please","body":"I wish we could control the climate, seat heaters, window defroster, music and just like some people said 10 minutes isn’t enough when it’s -10 degrees out for auto start. But I love how easy it is to schedule and make payments.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7246964842","version":"2.6.15","date":"2021-04-21T12:13:08.000Z","authorName":"Wschmomf","rating":2,"title":"BrassHat","body":"It would be great if the remote start worked 100% of the time. At best I would say 50%, maybe.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7237731565","version":"2.6.15","date":"2021-04-18T21:45:42.000Z","authorName":"Summer Darling","rating":5,"title":"Love this app!","body":"This app is extremely user friendly and convenient in every way. Only issue I had during the winter was a few technical difficulty on your end with the auto start. Other than that I absolutely love this app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7230413149","version":"2.6.15","date":"2021-04-17T00:55:49.000Z","authorName":"daytonawhite","rating":4,"title":"Way more reliable than Jaguar’s equivalent app","body":"This app is super simple to use, really convenient, and you can even make your monthly payment through it. My only gripe is the auto start feature. In cold weather, sometimes 10 minutes just isn’t enough to get the car as warm as I’d like it. Jaguar’s app allows you to run the engine for up to a half hour before it shuts off, and it’ll even activate the seat warmers once you get in. This one shuts the car off once you get in and you have to turn on the seat warmers yourself. On top of that, you can’t adjust the cabin temperature before activating the auto start like you can with Jaguar. Those are my only complaints. Otherwise, I find it really convenient.","voteCount":3,"voteSum":2,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7201962198","version":"2.6.15","date":"2021-04-09T12:44:41.000Z","authorName":"flor1anp","rating":1,"title":"Doesn’t work","body":"I keep receiving a message “technical issue on our end. Please try again later” no luck. I have to call costumer service to open a ticket every day. Mbrace not worth it","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7167615512","version":"2.6.14","date":"2021-03-31T18:19:59.000Z","authorName":"I-AM-CHANGE","rating":1,"title":"Complete garbage","body":"Mercedes you should be embarrassed.... horrible app horrible customer service.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7152224641","version":"2.6.14","date":"2021-03-27T21:52:19.000Z","authorName":"PKtherainmaker","rating":5,"title":"A35","body":"I love my A35 AMG  and the service","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7147566621","version":"2.6.14","date":"2021-03-26T17:41:16.000Z","authorName":"EricFigueroa","rating":5,"title":"Great customer service!","body":"I have Roxana helping me throughout the process of accessing the app. She was just amazing, profesional and very friendly!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7131297298","version":"2.6.14","date":"2021-03-22T12:04:28.000Z","authorName":"Jadakissv","rating":2,"title":"Great, when it works","body":"60% of the time it works every time.  \n\nThe only way to start my vehicle is through the app which more often that not gives me an error message about technical issues from Mercedes that prevents the car from starting. \n\nBoth of my households other vehicles can be remote started from the key, which compounds my frustration with Mercedes. \n\nThe door lock and unlock feature always work so that’s a plus...","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7128049118","version":"2.6.14","date":"2021-03-21T15:12:08.000Z","authorName":"Norms747","rating":5,"title":"New MB app","body":"Simply awesome.. very user friendly 👍🏽","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7124987629","version":"2.6.14","date":"2021-03-20T18:58:29.000Z","authorName":"mama cool","rating":5,"title":"Cla250","body":"Great great","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7117633208","version":"2.6.14","date":"2021-03-18T18:55:49.000Z","authorName":"GOTH3M","rating":5,"title":"Excellent","body":"Beautiful","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7116217455","version":"2.6.14","date":"2021-03-18T10:39:29.000Z","authorName":"James W Olivier","rating":1,"title":"Another Day Without Remote Start","body":"Every Other Day I Can Not Remotely Start My Car Because A Technical Issue On Your End Of App. I Am Going To Write This Same Review Every Day That This Happens. All This Money For Garbage!!!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7108725956","version":"2.6.14","date":"2021-03-16T09:40:32.000Z","authorName":"Queen_bsue","rating":1,"title":"Don’t buy the car","body":"This app which is mostly for remote start, works less than 50% of the time and I only use it in the winter. Garbage. This car has been the by far the biggest disappointment of my life.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7098704919","version":"2.6.14","date":"2021-03-13T15:03:30.000Z","authorName":"Lakemat","rating":5,"title":"I enjoy the convenience.","body":"This really comes in handy when I need to know the gas level and mileage. Also, starting remotely in the summer helps cool the interior.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7092819816","version":"2.6.14","date":"2021-03-12T01:26:59.000Z","authorName":"e350 Owner","rating":1,"title":"Embarrassing","body":"What a horrible experience.  The registration department hung up rather than solving the problem, they had no issues taking 280 bucks fir a year though.  Ben Wright from Prestige Nissan wasn’t any help.  He told me to not use the app and it would be worthless as my vehicle was a 2009 E-350.  Nbrace had no doubt it would would work with my make and model.  Prestige Mercedes in Paramus NJ could not commit to whether the app would work with the VIN provided.  They wanted approximately 190 per hour for 2 hours to tinker with it just in vase it worked without any commitment.  I declined","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7084740407","version":"2.6.14","date":"2021-03-09T21:42:35.000Z","authorName":"nome nomes","rating":5,"title":"Ms","body":"They’ve been great  I appreciate all that they’ve done for us","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7069873202","version":"2.6.14","date":"2021-03-05T23:51:51.000Z","authorName":"Derek Luis","rating":1,"title":"The car photo doesn’t appear","body":"The photo of my car don’t appear.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7069475350","version":"2.6.14","date":"2021-03-05T21:08:59.000Z","authorName":"PREPRE1","rating":1,"title":"Treating Owners Like Fools","body":"To say this app is unreliable and unable to deliver on the very limited functionality it promises is an understatement.  The remote start feature, as many, many others have observed, is a nullity.  It works maybe 1 of 5 times.  And that’s the main reason to get it.  As others have also said, the lock/unlock feature is rarely needed, and relies on the same unreliable interface.  The security feature I suppose is promising, and gets you a small insurance credit, but in the absence of an ability to demobilize the car, not worth the money.  I am also skeptical, given others’ comments on that as well, that local police would rely on it in real time.\n\nHow strange to have a subscription service at a relatively modest price that engenders dissatisfaction with the brand.  You would think that the would either comp it or fix it.  Instead I get angry at MB once a year when the subscription renews.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7069147888","version":"2.6.14","date":"2021-03-05T18:53:56.000Z","authorName":"shopamazon","rating":1,"title":"Very disappointing","body":"Mercedes needs to up its game. My car starts maybe 70% of the time. \nWhen I call them nobody knows anything!\nMy next car will not be a Mercedes","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7066051050","version":"2.6.14","date":"2021-03-05T00:07:58.000Z","authorName":"Chickn123","rating":5,"title":"Review","body":"Very user friendly","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7064852133","version":"2.6.14","date":"2021-03-04T16:13:00.000Z","authorName":"Exec.","rating":1,"title":"REMOVAL OF FEATURES","body":"Within 18 months after new vehicle purchase, the Electric Car page was discontinued with the statement there are no plans to replace it.  In the following year, Send2Benz disappeared from the app even though it is still listed as a feature. No real useful features left that would be used on a frequent basis.  Do not believe that what you have will continue to be supported.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7063803046","version":"2.6.14","date":"2021-03-04T10:43:42.000Z","authorName":"NARock","rating":2,"title":"FaceTime+","body":"Doesn’t work.....step your game up.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7062281060","version":"2.6.14","date":"2021-03-04T00:07:27.000Z","authorName":"pretione","rating":1,"title":"Expand to other devices","body":"Would like to see this compatible with iPad like the original app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7061831181","version":"2.6.14","date":"2021-03-03T20:49:43.000Z","authorName":"Benz1977","rating":5,"title":"Amg4life","body":"App is extension to vehicle.Loving when you can start the car on cold weather and locate the vehicle in shopping mall. Making payment is so much easy and all your statements are readily available.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7061675043","version":"2.6.14","date":"2021-03-03T19:43:43.000Z","authorName":"C300 RedFire","rating":5,"title":"Easy to make payment through the app","body":"This app makes it so convenient to make the payment through app and no need to worry for the late payment.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7054394967","version":"2.6.13","date":"2021-03-01T21:44:30.000Z","authorName":"XS Max owner","rating":1,"title":"This App Is Trash desperate need of update","body":"It’s pretty ridiculous that you can buy a way cheaper vehicle like over 10,000 dollar difference and they have a better more consistent non buggy application with 0 issues and you pay for the Mercedes-Benz name and expect high quality and you get crap.....Dear Mercedes-Benz Programer....Incase you have been living under a rock for the past 6 months your application has a bug saying that the windows and sunroof is open....I am still waiting for a fix....02/2021(6 month wait now) All the money I paid for this car you can’t fix the remote start bug? Shame on Mercedes-Benz!!!! Guess the name no longer stands for quality and high top notch technology","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7045173659","version":"2.6.13","date":"2021-02-27T13:52:03.000Z","authorName":"Kleb0609","rating":1,"title":"Robbed!!","body":"It’s been 5 years and the main option people want is to remote start their vehicle and YOU CANT GET THIS RIGHT. Constant errors, try again, down for maintenance and the best one you’ve tried too many times.  Of course I did didn’t work the first 3 times. \n\nThis is the only app I’ve ever written a review.  My first review was 2 years ago and my previous comments and rating have been wiped... convenient! This app had a 1-2 rating before. Seriously how viable is legal action?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7045008648","version":"2.6.13","date":"2021-02-27T13:04:02.000Z","authorName":"JoeBoxer7109","rating":3,"title":"Love my GLC","body":"The car’s handling is flawless, the app only enhances the enjoyment of owning a Mercedes. I’m able to check the status of the vehicle from fuel to location parked.\n\nI do not like it however, when the App doesn’t recognize my login information this has happened more than twice. I was using the lock my vehicle from the App and it didn’t respond causing me to walk back to the vehicle to lock it. That’s is frustrating especially went away from home and out of town. That aside the App is a nice feature.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7039545765","version":"2.6.13","date":"2021-02-26T04:53:18.000Z","authorName":"GOAMG-1","rating":3,"title":"So much potential","body":"I really appreciate the layout of app, easy to read, and it includes so many aspects of MB ownership. My issue is with the remote start function. It only starts half of the time it is requested, and when it does start, it takes too long to get going. \n        Also, and this may be operator error, but after remotely starting the car, it shuts off when I open the door. I don’t get that. Why make me start it all over again?  \n        Fix those two aspects you have a very fine app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7033757924","version":"2.6.13","date":"2021-02-24T16:41:54.000Z","authorName":"gooubytrdyjhdhh","rating":1,"title":"System","body":"Worst app I have ever experienced w a vehicle/ remote doesn’t stArt vehicle as stated issues on their side","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7030487345","version":"2.6.13","date":"2021-02-23T20:48:37.000Z","authorName":"mercedes me 305","rating":2,"title":"Barley works","body":"This is my first year trying this and my be my last if they can’t improve . There always having technical issues on there end. When I’m home with (WIFI), at work, or even leaving the store always Technical issues it’s getting frustrating. I like to warm my car up in the morning before I leave and I can’t most of the time. I rather the auto start on my key but unfortunately it doesn’t have it. Please improve","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7025462048","version":"2.6.13","date":"2021-02-22T13:37:22.000Z","authorName":"jasdabomb","rating":1,"title":"Horrible","body":"Too many glitches, app does more bad than good","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7022947195","version":"2.6.13","date":"2021-02-21T21:28:34.000Z","authorName":"Rachie6696","rating":1,"title":"App / remote start doesn’t work","body":"RARELY works. Probably going to call tomorrow and cancel for how much money it is. The remote start works maybe once. This app should be free until the bugs are fixed.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7015214060","version":"2.6.13","date":"2021-02-19T23:31:41.000Z","authorName":"BatmanBenny","rating":1,"title":"The worst","body":"This app never works. Can’t even start my car. On the few occasions when it does work it takes 3 to 5 minutes for the car to start. Why they don’t have the remote start button on the key Farb is ridiculous.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7014849703","version":"2.6.13","date":"2021-02-19T21:00:29.000Z","authorName":"Daviska25","rating":3,"title":"Doors","body":"Hate that you have to use the key fob to lock and unlock doors on a 2020CLA. Also when signal is low I get alerts stating that the vehicle has moved, just to find out it’s was still there and the alerts were just coming across late, whew can you imagine thinks someone was riding around in your car and you had the keys right beside you?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7011542282","version":"2.6.13","date":"2021-02-19T01:17:19.000Z","authorName":"GZNupe1981","rating":3,"title":"Engine remote start","body":"Remote start doesn't initiate every time.  This can be aggravating!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7010966048","version":"2.6.13","date":"2021-02-18T21:23:13.000Z","authorName":"RyanChiTown","rating":1,"title":"Unreliable Remote Start from App","body":"This app does not always allow the remote start to work and it fails at the absolute worst time in the dead cold Chicago winter. Why can’t they just put a simple auto start in a key instead of this stupid pointless app????  It’s a Benz!!!  Mazda remote starts are more reliable.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7010898130","version":"2.6.13","date":"2021-02-18T20:54:25.000Z","authorName":"rjcarinci","rating":1,"title":"Horrible App","body":"This is hands down the worst app I have ever used. The fact that it is associated with Mercedes is shocking. The app rarely works, send back the wrong messages and is completely unreliable. It’s total junk and will make me rethink purchasing another Mercedes as I try to use this app year round, almost daily, and I simply can’t get my car to start.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7009299393","version":"2.6.13","date":"2021-02-18T12:01:56.000Z","authorName":"Alarm installer","rating":1,"title":"Will never buy a Mercedes again","body":"I’ve owned cars from a Porsche 911 to a Ford Explorer and I can’t believe that Mercedes can’t get their act together on an app that is reliable. You can count on the app to work 50% of the time. And even when it does work and start the car, the app says, “failed to start”. This 2017 Mercedes S550 has been in production for about 9 years and the company can’t get its act together on an app. PS: My Ford Explorer app worked 100% of the time","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7006894739","version":"2.6.13","date":"2021-02-17T20:58:21.000Z","authorName":"SHOPPINGSTACEY1982","rating":5,"title":"GREAT APP!","body":"This App is all you need if you own a Mercedes! And it goe Adobe and beyond and works as a GPS and so much more!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"7006883863","version":"2.6.13","date":"2021-02-17T20:53:41.000Z","authorName":"Eisererbrant","rating":1,"title":"Remote start not working for over a year!","body":"My remote start for my GLC hasn’t worked for over a year now! Car turns on for 1-2 seconds and then immediately turns right back off and error of “technical issue on our end” Mercedes moto is the best or nothing. This app needs to be fixed or should be “nothing”","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6998323362","version":"2.6.13","date":"2021-02-15T18:24:37.000Z","authorName":"Sickofcandycrush","rating":5,"title":"Worse app ever","body":"The app needs major attention. \nDoesn’t unlock or lock my doors. Barely turns on engine. Always thinks my car is unlock when it’s locked. Also the payment financial system doesn’t even work. It always ask to click the link to actually log in on the website not on the app. Very inconvenient and also it sets up auto recurring payments in its own. When I didn’t even set it up. I was notified it was on. Whoever is in charge with website and app needs to get on it and fix this stuff. It’s so inconvenient and the customer service rep is so rude and doesn’t help at all.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6997562415","version":"2.6.13","date":"2021-02-15T14:15:20.000Z","authorName":"Jekwus","rating":5,"title":"Great App","body":"App works great but I guess last update caused some glitches. Now resolved...app works beautifully","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6990257534","version":"2.6.13","date":"2021-02-13T17:30:39.000Z","authorName":"Gri0213","rating":1,"title":"Worse App Ever! It’s really a 0 Star","body":"Horrible Horrible Horrible!!\nWhen you need the app “remote start” to work it doesn’t work! On those snowy icy days when you want to warm up your car for at least 20 mins especially when living in a high rise apartment, it comes back saying ....🔴Remote Start failed to initiate “unable to initiate because of a technical issue on our end”!! When I called Embrace they never know what the technical issue is. They always go through these repetitive trouble shooting steps that you’ve already done, and still nothing!! For god sakes I upgraded from a Honda to a Mercedes. At one point they told me to take the car to the dealership and see what they can do, really why, what does the dealership have to do with the app??!! Thank god I still have a free membership, this App is not worth the money!! Get it together Mercedes Benz/CEO/VP.\n\nUpset Consumer","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6986873255","version":"2.6.13","date":"2021-02-12T21:26:16.000Z","authorName":"Rocky362","rating":1,"title":"Rubbish","body":"The app is rubbish. Works perhaps 10% of the time. Remote start rarely works. You would think for the price of the car the app would be useful.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6986527598","version":"2.6.13","date":"2021-02-12T19:10:36.000Z","authorName":"Reddog101","rating":5,"title":"The Mercedes App","body":"The MBZ App was good at the beginning however with the continuing upgrades it’s GREAT\n\nROBERT","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6984364007","version":"2.6.13","date":"2021-02-12T07:04:01.000Z","authorName":"PeterJames000","rating":1,"title":"Constantly Fails","body":"While the “Mercedes me” and  the “Mercedes me connect” claim that you can do remote lock and unlock of the doors, remote start of the engine, etc., what actually happens is the application constantly fails to connect with the car. Hence there is no remote control whatsoever.  The app simply does not work.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6982614704","version":"2.6.13","date":"2021-02-11T19:08:20.000Z","authorName":"Innovate_H","rating":3,"title":"It’s a bit better than average, but should be better","body":"The app allows the remote start function, as long as there is more than 1/4 tank of gas.  There is an issue with your Siri shortcut implementation. It does not support activation from the watch.  It says need to log into the app… but you can run the command from the phone just fine. Please resolve.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6977363072","version":"2.6.13","date":"2021-02-10T12:07:23.000Z","authorName":"A new user 0987","rating":3,"title":"Remote start is hit or miss...","body":"Let’s face it, nobody downloads this app for the lifestyle or finance functions it’s the remote start function that we want. And that function is the least reliable thing that Mercedes has.  Seriously, you email me reminders that a service is due and are spot on but you can’t make the app work.  I’m going to say it doesn’t work about 30-40% of the time. That is Yugo level. I didn’t buy a Yugo.\n\nSo if you want it to start every time just get used to getting in the car a starting it yourself.  It’s either a “technical issue on our end” or “failed to initiate” or you have less than a 1/4 tank of fuel”.  Spend less development time on the lifestyle crap and make the one desirable feature actually work.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6975102883","version":"2.6.13","date":"2021-02-09T21:53:51.000Z","authorName":"cliffs pet","rating":1,"title":"Wrong vin","body":"It had my account but the wrong vin number and you can’t edit or delete it to fix it and if you try to delete the app and do again it remembers the wrong car and you can’t delete the car either.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6964125106","version":"2.6.13","date":"2021-02-07T05:42:12.000Z","authorName":"StackDaddy17","rating":3,"title":"Valet Protect Doesn’t Work","body":"This worries me when I trust the app to alert me. Sadly it does not. Often times actually turning off the valet protect without me even knowing","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6958587352","version":"2.6.13","date":"2021-02-05T21:04:32.000Z","authorName":"MB Lover 321","rating":1,"title":"Great App, still have some questions","body":"To whom ever it may concern,\n\nNow I don’t usually do this, but I love Mercedes! They have a reputation for luxury products and the app is no exception . An app that connects to your car? What’s not to love! However, I am having some trouble connecting the app to my car.\n\nAbout two years ago I purchased my car and from day 1 the driving experience has been unmatched. But when I downloaded the app, my feelings of euphoria turned sour. \n\nI have combed through my cars setting. Reached out to other owners. Redownloaded the app. All to no avail. \n\nWill someone please help? I love my F-150 and know that with just a little help I can get the app connected and be enjoying life again!\n\nSincerely, \n\nMB Lover 321","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6947130021","version":"2.6.13","date":"2021-02-03T02:50:53.000Z","authorName":"G in Chicago","rating":1,"title":"No remote start","body":"How long does it take to fix remote start?  It works on my co-worker’s Chevy everyday.  You should change your tagline to the “The best, or Chevy”","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6930269933","version":"2.6.13","date":"2021-01-30T00:20:18.000Z","authorName":"Upper Lars","rating":1,"title":"Remote engine start fails every winter","body":"The most important part of the app regularly fails when it’s needed most. Every winter half of the time I try using remote start it fails. Says it’s because of a technical issue on their end. But it could be a game changer when I start looking for a new vehicle, this is unacceptable","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6925410362","version":"2.6.13","date":"2021-01-28T20:33:03.000Z","authorName":"JasonP QA Engineer","rating":2,"title":"It works but takes too long, login issues","body":"It takes over 2 minutes to start my GLE350 compared to less than 5 seconds using a traditional remote starter. Granted, this app calls Mercedes server to authorize and then send return signal to vehicle, but 2 minutes...? This automated process shouldn’t take more than 30 seconds total. \n\nThe only way to authorize this app after you’ve already unlocked your phone is to use Face ID.  I’ve already unlocked my phone.  I shouldn’t need to unlock this app. And why is there no backup numeric password as an alternate login?  Face ID or nothing!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6923466477","version":"2.6.13","date":"2021-01-28T11:47:19.000Z","authorName":"mbm8e","rating":1,"title":"Unreliable","body":"I can’t rely on any of the features in this app to work at any given time. I currently live in the northeast and the remote start feature works less than 50% of the time. Unacceptable for weeks when the mornings start below 30 degrees","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6921465723","version":"2.6.13","date":"2021-01-27T23:27:18.000Z","authorName":"PraiserT","rating":5,"title":"Mr. J. Lard","body":"This app is Awesome!! It helps me so much! It so convenient!!! Enjoying it to the max !! It have a few bugs that needs to be fixed but overall , it’s great !","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6920110865","version":"2.6.13","date":"2021-01-27T15:13:20.000Z","authorName":"RH11235813","rating":1,"title":"Apple Watch and MB","body":"Why doesn’t this app work on my Apple Watch? Keeps saying mbrace pair a vehicle with your phone!? I have....Mercedes me connect works fine on my iPhone....what’s going on!! Very frustrating.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6888097520","version":"2.6.12","date":"2021-01-19T10:31:58.000Z","authorName":"Tatata29","rating":1,"title":"The worst part about my mercedes","body":"The tittle say it everything! I love my mercedes but this app 90% of the time doesnt work !!! Plain and simple!!!! It logged me out several times a week, most of the time wont start my car !!! It is actually a shame for mercedes.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6860923951","version":"2.6.11","date":"2021-01-12T12:17:06.000Z","authorName":"JOHELP","rating":3,"title":"Siri shortcut not working after update","body":"The Siri shortcut no longer allows me to remote start my car from my Apple Watch without first unlocking my phone AND the app!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6858805321","version":"2.6.11","date":"2021-01-11T22:33:23.000Z","authorName":"Mardiggg","rating":5,"title":"Great app","body":"Great app, could start my car from anywhere. It does take a while sometimes to start the engine but overall great app to have.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6853857226","version":"2.6.11","date":"2021-01-10T16:03:10.000Z","authorName":"sick of Directv's nonsense","rating":1,"title":"Very buggy, even with a brand new phone","body":"Sometimes it works sometimes it doesn’t even with the latest updates on your phone. \nDon’t understand why are you can’t remote start your car like every other car maker from the key fob, there not a cheap car even though the quality of it sometimes seems like it. \nBattery’s on the key fob last a shocking short time as well, very inconvenient when your trying to get in the car and can’t open the door","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6851357236","version":"2.6.11","date":"2021-01-10T00:54:09.000Z","authorName":"Jeepin741","rating":1,"title":"This app doesn’t work","body":"It does not work at my house where there is no cellphone service.   But anywhere else it works fine.   I don’t under stand how there no manual remote start on the key fob in such cases where there’s no cell service","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6851106524","version":"2.6.11","date":"2021-01-09T23:19:33.000Z","authorName":"JVS2989","rating":3,"title":"Bad connection to the car. (E300 4matic sedan 2017)","body":"The app has to connect better with the car, sometimes I want to start the car from a distance and it tells me that the windows or the sun roof is open and it is not true, it also does not turn on because the gasoline is less than 20% and not  It is true, It also does not heat the car seats, you should have this option for when you turn on the car with the app, at least in cities that are very cold.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6842989477","version":"2.6.11","date":"2021-01-07T21:43:35.000Z","authorName":"jewelman55","rating":4,"title":"Easy","body":"Well this app is very easy to use it doesn’t have my car info only because it’s 15 years old 2005.\nOnly for that reason it gets 4 stars not 5","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6840860036","version":"2.6.11","date":"2021-01-07T09:20:53.000Z","authorName":"David vazquez ocasio","rating":5,"title":"Excellent","body":"Is essy and clear","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6832510703","version":"2.6.11","date":"2021-01-05T04:31:34.000Z","authorName":"Thibac","rating":5,"title":"OK, but room for improvement.","body":"In general good functionality, but remote start needs to go much faster.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6815342016","version":"2.6.11","date":"2020-12-31T18:44:35.000Z","authorName":"shortcake9414","rating":1,"title":"Mbrace connect","body":"Never works and they can never setup my account and now it has “expired” 🙄","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6807443731","version":"2.6.11","date":"2020-12-29T16:14:49.000Z","authorName":"chichapher","rating":2,"title":"Needs some improvements.","body":"I primarily use the app for remote start and remote lock or unlock. The app has a history of forgetting your quick login code and forcing you to accept new eula and login again which is a pain. Lately it has been doing it less frequently. The remote start  app is terrible. Requires you to have more than “5 gallons of gas” but for my car that means that anything just under half a tank or less will result in the remote start not working. Lame. Also it shuts off the second you touch the door locks. Also lame. Could be cool if they changed those 2 features.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6803201532","version":"2.6.11","date":"2020-12-28T13:29:48.000Z","authorName":"One papa","rating":1,"title":"Bad app","body":"This app needs a lot of work open windows 1:4 gas tank. !!!!’ It’s not a reasons for not starting the car. Too slow.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6803180705","version":"2.6.11","date":"2020-12-28T13:23:07.000Z","authorName":"DimaTurcan","rating":2,"title":"MERCEDES OR NOT?","body":"Remote starter failed to initiate because of technical  issue on our end . \nin 80% of time the car doesn’t start . sad","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6795813930","version":"2.6.11","date":"2020-12-26T13:56:37.000Z","authorName":"Geraldo First","rating":5,"title":"Grade A","body":"Grade A","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6793383029","version":"2.6.11","date":"2020-12-25T21:39:22.000Z","authorName":"me654321","rating":4,"title":"Almost 5 stars","body":"My only thing is. I wish you could take and send from your Apple iPhone a pin drop location to the navigation on board without plugging in!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6790081518","version":"2.6.11","date":"2020-12-24T23:38:39.000Z","authorName":"ctg1948","rating":2,"title":"Mercedes Me","body":"Never got it to work correctly and got tired of calling them telling them it will work tomorrow. For me a waste of time & haven’t looked into I’m paying for it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6786449719","version":"2.6.11","date":"2020-12-23T23:12:48.000Z","authorName":"TMack63","rating":4,"title":"Make it Better","body":"I truly enjoy using the app and features that it has. I wish that it was a way to allow allow another users to use the App without using the login info of the Main user. Also I wish that once you Activate the use of any part in the Drivers Journal it last longer then 24hrs. The speed of the App needs to improve as well.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6783002749","version":"2.6.11","date":"2020-12-23T00:00:37.000Z","authorName":"hebahammoud80","rating":5,"title":"Summary","body":"It was the best app in the wrld","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6782132340","version":"2.6.11","date":"2020-12-22T17:47:16.000Z","authorName":"PMC-SEA","rating":1,"title":"Horrible update","body":"It’s worthless now as all vehicle monitoring functionality is broken.  None of them will activate and of course there is no error message telling you why. Just poor design and coding. Very amateurish.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6775204806","version":"2.6.11","date":"2020-12-20T18:26:41.000Z","authorName":"Jms614","rating":1,"title":"Absolute worst app","body":"Most unreliable app ever. It’s been almost three years and every “improvement” just creates more issues. Maybe one day you’ll be able to remain “logged in” or even better, be able to start the car with more than half a tank of gas. Counting the days for the lease on the car to be up. I hate this app so much, It makes me never want a Mercedes again. It’s difficult to understand how such a high end company/vehicle develops such a crap app. More importantly, not recognize this and do something about it. It’s been years now. Counting down the days....","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6760802598","version":"2.6.11","date":"2020-12-16T21:00:40.000Z","authorName":"Qtrmile75","rating":4,"title":"Great App ... But...","body":"The app is great but it should allow more flexibility. Example would be to control the heat / air conditioning from the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6759754919","version":"2.6.11","date":"2020-12-16T14:43:49.000Z","authorName":"Alessandra292913","rating":5,"title":"Love this app","body":"This app lets me do everything I need to with my Mercedes. From paying my bill to scheduling a service to starting my vehicles. Thanks for always improving this app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6757451592","version":"2.6.11","date":"2020-12-15T22:34:24.000Z","authorName":"Eve posh","rating":1,"title":"2018 GLC63s","body":"This remote start works 1 out of 5 or 6 times?   After spending $110,000 for this car?   Really?   Terribly disappointed in mercedes","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6756202766","version":"2.6.11","date":"2020-12-15T14:33:21.000Z","authorName":"seanrpina","rating":1,"title":"Bad","body":"Slow app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6748602711","version":"2.6.11","date":"2020-12-13T11:11:26.000Z","authorName":"mstfsahin2","rating":5,"title":"Worst app ever","body":"Is this Renault's app or what?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6743371253","version":"2.6.11","date":"2020-12-12T01:33:28.000Z","authorName":"The1MacGyVer","rating":1,"title":"Could be a lot better!","body":"The remote start function is a hit or miss situation. It “normally” takes 10 to 15 minutes for the car to start (if it starts at all). Why couldn’t you just put a button on the keyfob like everyone else. Push a button and it instantly starts. What a novel idea!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6742601973","version":"2.6.11","date":"2020-12-11T20:33:49.000Z","authorName":"jesavail02","rating":1,"title":"My first and last Mercedes-Benz. Terrible experience and never again","body":"Purchased 2016 CLA250 in 2019. Car saleswoman told me remote start is available thru mbrace app. I was shocked that Remote start was not a standard feature for MB. Called to activate Mbrace but my vehicle was not supported but it’s being updated. I waited 1 year for the Mbrace services to find out this week that the remote start feature is not included for my vehicle.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6736296111","version":"2.6.11","date":"2020-12-10T03:11:47.000Z","authorName":"RSSand","rating":4,"title":"Some loss of features with the last eat up date","body":"The car location function does not update after the first location appears while the app is open. I have to close it and reopen the app for the location to update. Perhaps I’m doing something wrong.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6735635665","version":"2.6.11","date":"2020-12-09T22:24:14.000Z","authorName":"izquiertoto","rating":1,"title":"New s class owner","body":"I’m totally dissatisfied with the auto start function \nI been asking mercedes dealer for over a year already and the multiple service advisors I have spoken too , I have also call corporate to request this feature to be disable permanently but to go on deft ears and totally be ignore . \nAs a new mercedes owner i don’t like my new car to be going off at every traffic light It actually stresses me out , my car goes off when pulling into my driveway also at a rail road wish it is not safe at all . \nWhen I ask bmw to turn the very same feature off permanently in my other car they did so and listen to me but mercedes won’t do the same . \nThis really makes me wonder if they really care about the consumer they would have already created a way to turn this feature off permanently ? \n\nHopefully they listen to this and honor my request \nEveryone I have talk to in the dealer including service advisers and managers they tell me that they been getting a lot of customers requesting the same thing and there in no available update to be able to turn this feature off .","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6726033857","version":"2.6.11","date":"2020-12-07T05:24:25.000Z","authorName":"POESWORLD","rating":3,"title":"Not bad but could be much more useful","body":"From a basic, (service, remote start, lock, locate vehicle), perspective the app is good., however, there are many more practical application aspects that could be included; i.e upgrades, parts, supported mods, trade-in offers and options.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6716975716","version":"2.6.11","date":"2020-12-04T15:54:36.000Z","authorName":"trone.202","rating":4,"title":"EDITED - Bait and switch TRASH...not","body":"I apologize for this previous review & rating without thoroughly reviewing all of the updates. However, I did have to call Support to find out where the Remote Start was.\n\n[ Once again, here we go with the app “latest updates”. Trash! Poor UX/CX. Jumps from one app to another. Hello...ever heard of enterprise consolidation? \nWHERE THE HECK IS THE REMOTE START NOW??? Car was purchased brand new in 2019 which includes a 5yr Embrace account. Now, with this recent app update (11/20), features like Remote Start are gone! Winter is right around the corner (smh)!]","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6716948626","version":"2.6.11","date":"2020-12-04T15:45:23.000Z","authorName":"Fat boy21211","rating":2,"title":"Needs some work","body":"The remote start hasn’t worked for me since downloading the app. Makes making my car payment easy. Cool looking app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6714788637","version":"2.6.11","date":"2020-12-04T01:01:25.000Z","authorName":"Singh44","rating":1,"title":"Fails, could be secondary to recent Verizon regarding its 3G network","body":"Over the last few weeks, the remote start option hasn’t worked me for me at all. The feature was erratic at best, now completely non functional at worst.\n\nWonder if it’s related to Verizon reframing it’s spectrum from 3G network ( which Verizon telematics uses for this app) to 5G recently.\n\nI think MB needs to update the modem to an LTE version for better reliability","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6713104771","version":"2.6.11","date":"2020-12-03T13:33:08.000Z","authorName":"JKay580","rating":1,"title":"HORRIBLE","body":"BEWARE! This app is useless and only works about 95%! I will NEVER pay for crap like this!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6707930909","version":"2.6.11","date":"2020-12-02T01:39:08.000Z","authorName":"Veronspecie","rating":1,"title":"Please do better","body":"Honestly for a brand like this one would expect better. Very disappointing to come here and see others are fusing about this. Two issues I have with this app, firstly, I get signed out from the app and have to accept terms and conditions all the time. Secondly, why would after remote starting the car, it goes off when you open the door? I mean that doesn’t make sense. Please do better Benz!\n\nI’d to come back to see if I can reduce my star rating to zero or give this app another rating. All of a sudden my remote start never works lol. There should be an option for zero stars honestly. This app is USELESS","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6707583092","version":"2.6.11","date":"2020-12-01T23:11:29.000Z","authorName":"L80Rae","rating":2,"title":"Not great","body":"This app works when it wants for the automatic start feature. That’s the only thing I use it for. More often than not I receive the “car could not be started bc of a technical error” or something to that effect. Really annoying when you think you’ve paid for convenience.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6699879341","version":"2.6.11","date":"2020-11-29T18:07:48.000Z","authorName":"Another Lost customer","rating":3,"title":"Better than first gen app.","body":"Better overall design. \n\nPlease add the ability to adjust car temperature and seat heating and cooling after starting engine with remote start!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6696954866","version":"2.6.11","date":"2020-11-28T23:25:04.000Z","authorName":"olu-bos","rating":2,"title":"Basically useless","body":"This would be great if it could remote start the car. Yes the doors are locked and the gas tank is filled enough.  It repeatedly fails despite knowing where the car is (so there is some communication between the car and the app).  My success rate for starting the car is 25% at best.  The only reason I don’t give it one star is that the geofence feature actually works.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6689594627","version":"2.6.11","date":"2020-11-27T00:27:49.000Z","authorName":"dmt953","rating":1,"title":"Very slow and fails to start your car half of the time","body":"Slow to load and execute","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6689321659","version":"2.6.11","date":"2020-11-26T22:25:41.000Z","authorName":"Adjsz","rating":5,"title":"Perfect for what I need","body":"Basically the best one for what I need","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6687643870","version":"2.6.11","date":"2020-11-26T11:57:54.000Z","authorName":"CableAB","rating":5,"title":"Excellent App","body":"Terrific app to operate the door locks and start the car for warm-up. The app logs user out too easily and can be difficult to log back in from time to time. Excellent Apple Watch integration","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6686767815","version":"2.6.11","date":"2020-11-26T05:58:48.000Z","authorName":"Luigis Logic","rating":1,"title":"No Remote Start! What The FK! It’s a Mercedes! Benz!!!","body":"I Just bought the 2020 GLB one of my criteria was remote start and now I’m finding all this out I’m disappointed a brand like Mercedes . Maybe they should have Apple test the app for them, sounds like they need help in this area, I’m also hearing the last app was junk as well and here we are. Come on Mercedes Me Connection Team  I’m rooting for you! It’s only up from here. And I’m giving you a one Star to let others know its not just their Mercedes Benz that can’t remote start.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6678151200","version":"2.6.11","date":"2020-11-23T18:26:12.000Z","authorName":"Azzazzello2","rating":1,"title":"For such quality car, such terrible software experience","body":"Slow, buggy, slow, login process broken half the time.  \n\nVery disappointed with MB software capabilities.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6678018729","version":"2.6.11","date":"2020-11-23T17:35:07.000Z","authorName":"shesdope","rating":4,"title":"It's fine.","body":"I wish it would tell you if your alarm ous the one going off. Maybe it does that, but you have to pay extra. That should be free if it's not. \nOtherwise it's great. Thanks.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6675311081","version":"2.6.11","date":"2020-11-22T23:21:21.000Z","authorName":"agarayev","rating":1,"title":"After last update app is USELESS","body":"After last update i can not unlock, start my car. iPhone 12 pro max, 2020 MB GLE","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6674978546","version":"2.6.11","date":"2020-11-22T20:53:23.000Z","authorName":"Dr123ty","rating":2,"title":"Not reliable","body":"Unfortunately i do not have a nice experience with this app.   When it is very cold, it is often under “repair” or something","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6666111567","version":"2.6.10","date":"2020-11-20T12:12:55.000Z","authorName":"Nic7Oliveira","rating":1,"title":"The Worst","body":"This app is so unreliable. Some days it decides to work, other days it doesn’t. Haven’t been able to remote start my car in months because my “windows are open”.. They’re not open. A lot of other people are having this problem, so it must have to do with the app. Please come out with a software update. I was able to remote start my Honda but not my Mercedes... Ridiculous.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6664436058","version":"2.6.10","date":"2020-11-20T00:11:25.000Z","authorName":"nala","rating":1,"title":"My $24,000 Hyundai remote app works great - My $78,000 e400 remote app is a joke","body":"How could this be?\nI’ve had this car 2 1/2 years now and they still haven’t figured out how to provide a reliable app that I can use to remote start my car.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6630927115","version":"2.6.10","date":"2020-11-10T21:06:10.000Z","authorName":"Rbabie21","rating":2,"title":"Don’t like it","body":"Had to give it a 2 star. The old one was better! This new App don’t support the finance section which was so easy to pay your bill on time and track your progress. Having to always go on the website isn’t fun! I hope they upgrade it but at this point it’s a waste having the app for me.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6629352631","version":"2.6.10","date":"2020-11-10T12:08:49.000Z","authorName":"Weckette","rating":1,"title":"Will it work TODAY??","body":"That’s the big question. Will this remote- start even work today? This is the worst app ever, one day it works, the next ten times it doesn’t. You have to keep signing in or it doesn’t recognize your sign-in, or you don’t have enough gas even when there is half a tank. With each new update, no big miracle updated. Good thing we don’t pay for it, but we do pay enough for your cars. Maybe try it on the key-fob like other car companies. There’s an idea! 🤨","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6622670399","version":"2.6.10","date":"2020-11-08T14:06:41.000Z","authorName":"WaBenzo","rating":3,"title":"A work in progress","body":"The app is okay but could be more efficient. It takes too long for the car to start remotely. Timer should be set to 15-20 mins for the car to warm up. On very cold days, it needs more than 10 mins to get warm.  There should also be an option to remotely increase the temperature in the car when it’s turned on, especially on cold days.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6616434582","version":"2.6.10","date":"2020-11-06T20:51:33.000Z","authorName":"TTay96","rating":3,"title":"Frustrating !!","body":"This app is super convenient to pay your bill when it actually works! My finance section constantly is unable to load which I cannot stand. I just want to be able to sign in and pay my bill without the hassle and frustration","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6612642937","version":"2.6.10","date":"2020-11-05T19:36:26.000Z","authorName":"Iphonecommander123","rating":4,"title":"Could be much better","body":"Allow sending an address from google maps and Apple Maps","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6609666335","version":"2.6.9","date":"2020-11-04T23:16:11.000Z","authorName":"RKCBAD","rating":1,"title":"Worst app I have ever dealt with","body":"I have never in my life spent so much time with customer support to try to get this app to work on my phone.  I have spent literally 34 hours with their customer service to try to get this to work. It’s unbelievable. Why would a company like Mercedes Benz fail so badly at this? I’m on hold as I’m typing and the on-hold music is driving me insane. Ugh.  This doesn’t deserve 1 star.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6609081054","version":"2.6.9","date":"2020-11-04T18:52:19.000Z","authorName":"Chariotsofliar","rating":4,"title":"Don’t leave phone plugged in","body":"This worked for me 99% of the time except for the day I left my iPhone plugged in inside my car. It wouldn’t let me connect my Apple Watch to the app to open the car. \n\nLesson learned.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6607014576","version":"2.6.9","date":"2020-11-04T05:20:38.000Z","authorName":"new owner 2020","rating":3,"title":"Driver journal & more..","body":"It’s very annoying to update the driver journal everyday..we need another option. When are we getting Mercedes me 20 like the UK? So many more options like our gas mileage, service detail, tire pressure, mileage used, doors opened or closed, windows opened or closed. Travel distance, track destinations...etc! Step it up to modern times! Other manufacturers have it, so it can be done!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6605726339","version":"2.6.9","date":"2020-11-03T19:24:03.000Z","authorName":"Brando63835","rating":1,"title":"Remote start doesn’t work","body":"It boggles my mind that after 4 years they still haven't made the remote start reliable. I had it work 2 out of 20 times and Im done trying. Mercedes invest in your company and fix this app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6604173692","version":"2.6.9","date":"2020-11-03T10:25:24.000Z","authorName":"hollywoodstarfish","rating":4,"title":"Much Better","body":"Seems to be a littles less finicky lately. Before I had to constantly sign in and accept terms. Now it seems to works properly 8 times out of 10. So we are good for now!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6602243912","version":"2.6.9","date":"2020-11-02T19:56:45.000Z","authorName":"Tattylew","rating":5,"title":"Greaaat!","body":"I love this app! It’s so easy to use!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6601364716","version":"2.6.9","date":"2020-11-02T14:41:11.000Z","authorName":"Bowling creature","rating":1,"title":"Terrible","body":"The remote start rarely if ever works. Living in the Midwest this is a big thing. All the features take forever to complete. This is the worst app imaginable AND now my subscription is expired and supposed to pay $$ to continue using this garbage and hope that the remote start turns on my car in below freezing weather.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6601339586","version":"2.6.9","date":"2020-11-02T14:34:08.000Z","authorName":"GLCSal","rating":1,"title":"Mercedes me","body":"Nothing works on the app at all at anytime.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6596986308","version":"2.6.9","date":"2020-11-01T10:33:44.000Z","authorName":"ndhcufw","rating":1,"title":"Remote start fails a lot","body":"Remote start fails quite often over the past 2.5 years that I’ve used this app.  I don’t have any reception issues, says my doors are unlocked when they’re locked, the car starts the turns off then app states a failure, or it just fails staring an error on your end.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6590694568","version":"2.6.9","date":"2020-10-30T16:46:12.000Z","authorName":"Iupab","rating":1,"title":"Worthless App","body":"1.Remote start has rarely worked\n2. Why don’t you show actual mileage ...oh and how about mileage relative to next service \n4. How about service record \n3. Why have manuals to download when this app is only compatible with iPhone ?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6588543380","version":"2.6.9","date":"2020-10-30T02:45:55.000Z","authorName":"Foga Road","rating":3,"title":"Need a lot of Inprovement","body":"This App need a lot of improvement it’s very slow and could be a much better App if they improve on the response time, most time I get to my Car long before my Car is start if it even if Start.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6584989759","version":"2.6.9","date":"2020-10-29T02:34:27.000Z","authorName":"ToroGirl7","rating":1,"title":"Horrible App","body":"For Pete’s sake why can’t this app keep me signed in? I’m out and about and don’t want to have to log in every time I want to make sure my doors are locked! So frustrating. I had facial recognition on but it doesn’t allow me to log in that way. Please fix this!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6584084339","version":"2.6.9","date":"2020-10-28T19:57:16.000Z","authorName":"10bre10","rating":1,"title":"Remedial app","body":"Why aren’t you competent enough to make an app that works? Why is it so hard to start the car from the app? Why does the car shut off as soon as the door is opened? Did anyone earn a degree that wrote the algorithms for this app?😕","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6580028566","version":"2.6.8","date":"2020-10-27T16:55:51.000Z","authorName":"81 Young","rating":5,"title":"DR. B","body":"I find it very helpful with sending addresses to my car","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6578622560","version":"2.6.8","date":"2020-10-27T08:35:23.000Z","authorName":"Jonathan eaton","rating":1,"title":"Doesnt work with rental cars","body":"Doe sent work with rental cars.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6578606071","version":"2.6.8","date":"2020-10-27T08:28:23.000Z","authorName":"TByrd1777","rating":3,"title":"Love the idea","body":"I love the idea and features of the app; however, it is slow for today’s technology. I also have a problem with the app logging me out. Every few days, I have to go through the service agreement, logging in and reestablishing my face access. I’ve tried uninstalling and reinstalling, with no change. I’m a life long Mercedes-Benz owner, so I’d love to see more dedication returned in the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6576910106","version":"2.6.8","date":"2020-10-26T19:07:37.000Z","authorName":"cashmoney543p","rating":1,"title":"Killed my ability to pay monthly payments via the app","body":"There is no longer an option to make payments directly through the app for me (iPhone 11 pro max, Verizon). As someone who doesn’t have an embrace account the only reason I downloaded the application was for this ability. Will be recommending others that this app is not useful anymore","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6567027313","version":"2.6.8","date":"2020-10-23T23:34:21.000Z","authorName":"RollTide2010","rating":3,"title":"Version 2.6.8","body":"Driving Journal not working. It would be nice to be able to have this on at all times instead of just some times. I believe the app could be a lot better. It should be able to provide more information about the vehicle (e.g., mileage, fuel level, tire pressure, etc.).","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6563564189","version":"2.6.8","date":"2020-10-22T23:34:39.000Z","authorName":"Jestin R.","rating":5,"title":"Fix for App logging out","body":"If you go into settings on your phone and scroll to the Mercedes me app and tick off background APP refresh. So far it’s been a few days and it hasn’t logged out yet.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6560074712","version":"2.6.7","date":"2020-10-21T22:56:21.000Z","authorName":"unhappy car owner","rating":1,"title":"REMOTE START IS A PIECE OF JUNK!!!","body":"I don’t care about any of the features except the ability to start my car remotely during the winter in MN and it doesn’t work! It worked intermittently last winter and this winter every time I use it it tells me that my windows or sunroof is open which they are not. Mercedes should be ashamed and embarrassed. They say they have fixed the problem of having to login all the time. Doubtful but who cares if it won’t start my car!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6560041743","version":"2.6.7","date":"2020-10-21T22:40:28.000Z","authorName":"Thornton MB","rating":5,"title":"Great App","body":"Mercedes outperforms competition again. Wonderful app for a wonderful car.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6559779293","version":"2.6.7","date":"2020-10-21T20:37:20.000Z","authorName":"Fulano83","rating":1,"title":"Keeps Logging out even after fix","body":"This app is annoying, lacking on features and most times completely useless. It keeps logging me out numerous times throughout the day. Get this app stable and add better more useful features.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6559112709","version":"2.6.7","date":"2020-10-21T16:29:48.000Z","authorName":"idkWBiguess","rating":2,"title":"When the system is not down...","body":"it is fine. However I get a system is down loading error often, and I don't use it that much. Always down as soon as it snows or gets truly cold in Minnesota, when I need it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6557346217","version":"2.6.7","date":"2020-10-21T04:40:09.000Z","authorName":"K-Fresh11","rating":1,"title":"What’s with the logins all the time?","body":"I would rate this app 5 stars but the fact I have to login almost every other time I open the app has basically ruined the user experience for me... this needs to be fixed ASAP! I have to read the terms and conditions every.single.time","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6552740197","version":"2.6.7","date":"2020-10-19T20:55:27.000Z","authorName":"Fredstem","rating":1,"title":"Mercedes: you can do better than this","body":"First - the new release doesn’t fix the constant logging out issue !\nSecond - The app works only from time to time and unusable now with this logging issue. \nThird - And you don’t want to get me started on the Watch app that works once in a while, does nothing the rest of the time or ask you to connect to your phone ! \n\nCome on Mercedes - hire a real developer and fix this !!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6547981992","version":"2.6.7","date":"2020-10-18T12:28:54.000Z","authorName":"Ian_Ashton","rating":1,"title":"Absolutely useless!","body":"If it’s able to connect, which is rare, it TAKES FOREVER. Get it together MB, this service is trash.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6542289596","version":"2.6.7","date":"2020-10-16T20:06:07.000Z","authorName":"pwreviewsapps","rating":1,"title":"Logs me out daily","body":"This is the worst I’ve ever seen this app! \nI’ve had my 2014 GL350 on my Mercedes me app since April. I like the features even though the app has been completely forgotten about, so nothing is up to date or very relevant. \nMy biggest complaint is being logged out of the app on my iPhone SE (2020) and Apple Watch series 5 everyday. It’s the dumbest thing in the world. And no one from my race has been able to help. \nWhatever reason you chose to buy a Benz, make sure it’s not because of this crappy app.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6538303283","version":"2.6.7","date":"2020-10-15T16:53:08.000Z","authorName":"stevebaribeau","rating":1,"title":"Me Connect!","body":"When I try to download I’m told the app needs specific features which my iPad does not have?  So, I’m constrained to iPhone...I hate small screens!  Do better!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6535794036","version":"2.6.7","date":"2020-10-14T23:40:29.000Z","authorName":"Luralei","rating":1,"title":"Update Has Opposite Effect","body":"New update to prevent premature logouts now has me unable to login. That’s problem solving outside of the box! Log in had me create new password and then wanted me to give them a new email address. It just got worse and now I am locked out from logging in. “Try again later” it says. I can’t post what I’m saying.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6532294759","version":"2.6.7","date":"2020-10-13T23:07:10.000Z","authorName":"Danny1680","rating":1,"title":"Horrible","body":"It always throws me out of my log in and I have to repeatedly put in my email address and password. It does not remember my info.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6528454526","version":"2.6.6","date":"2020-10-12T19:45:45.000Z","authorName":"jreng123","rating":1,"title":"Total junk","body":"Every time I try to use the app it asks for email and password even though I have “stay logged in “ checked.  Only works some of the time.  Very slow and often fails. Have 2 Cadillacs with OnStar.....MUCH BETTER! You would think a $108,000 Mercedes Benz S Class would have an app that would try to satisfy customers. Very poor development.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6525207835","version":"2.6.6","date":"2020-10-11T20:25:10.000Z","authorName":"Yplus3","rating":1,"title":"Doesn’t even work","body":"I was set up and ready to go at the dealership. Got home and the app says it’s down for maintenance. It has yet to work. Ridiculous","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6523965350","version":"2.6.6","date":"2020-10-11T13:11:11.000Z","authorName":"James Russell Keys","rating":5,"title":"Opportunity for Improvement","body":"I like the app overall, but dislike that you are logged out for updates. Please look into a resolution for this issue.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6522601525","version":"2.6.6","date":"2020-10-11T03:30:09.000Z","authorName":"TypoBoy","rating":2,"title":"I'm far more impressed with my vehicle than the app","body":"Reading the reviews, perhaps my expertise in information and interaction design fosters unreasonable expectations but..., Why, if I have this app, should I have to another to track my mileage, or the number of miles on the current set of tires? It's great for making payments, or accessing the bundle of \"because-you-can,\" subscription services - I guess I don't remotely lock and unlock me car often enough; but beyond that, not a ton of practical functionality. It doesn't connect with other apps, or integrate with many of the devices capabilities, overall, fails to extend owner access MB information or resources. For example, notwithstanding all the service data MB maintains on my vehicle, I can't view the dates and nature of my last and next scheduled services. ... I'm underwhelmed.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6520372759","version":"2.6.6","date":"2020-10-10T13:02:42.000Z","authorName":"BooShak5","rating":4,"title":"App is more user friendly than prior app","body":"I’m learning to navigate the new app and it’s definitely more intuitive than prior apps. I like the look and feel and wa able to find the finance section easily.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6518735178","version":"2.6.6","date":"2020-10-10T01:20:17.000Z","authorName":"BamaME94","rating":1,"title":"Complete garbage","body":"This app is a grade A pile of crap. I don’t use all that often, but every single time I do it requires me to scroll thru the terms and conditions and accept them, then login. Additionally I have to go to the settings to enable Face ID even though I’ve done this numerous times. The end result is that I can get to my car and start it quicker than I can do all of the login horse&$!; that I have to do to start via the app. And all of this is on top of the lousy failure rate I’ve experienced in actually executing commands to the vehicle. I expect better from my high priced European luxury vehicle. DO BETTER MERCEDES!","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6515149421","version":"2.6.6","date":"2020-10-09T00:06:14.000Z","authorName":"Super Bowl Champion Pats","rating":2,"title":"Stop with “I agree w terms” every time","body":"It’s getting very old to have to agree to terms practically every time I open the app. Once I agree, I’m done—don’t keep requiring. It could be 5 star app, but taking so long to log in makes it useless.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6511848716","version":"2.6.6","date":"2020-10-08T00:41:11.000Z","authorName":"davidlefavor","rating":3,"title":"Please let me use on my iPad","body":"The app itself is pretty usable once you figure out how to navigate and when to use Mercedes me versus Mercedes me connect.\n\nI see no reason to limit the app to cellular devices only. Having to pick up my smartphone to do anything is annoying.\n\nAlso while you are at it, please make it work in landscape mode.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6500617464","version":"2.6.6","date":"2020-10-04T19:02:45.000Z","authorName":"Lily4411","rating":1,"title":"Unavailable, unreliable","body":"Cannot even download it to my iPad - beyond useless","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6499378657","version":"2.6.6","date":"2020-10-04T12:11:58.000Z","authorName":"Gamejunquie","rating":1,"title":"Garbage and unreliable.","body":"This app is completely unreliable. In the 2+ years I’ve had it it has worked MAYBE 5-8 times. And they want me to renew this “valuable service “!! Hahaha no. Do not rely on this app for ANYTHING.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6499312623","version":"2.6.6","date":"2020-10-04T11:48:06.000Z","authorName":"Edjee111754","rating":4,"title":"Too many logins","body":"I have to log in too many times to gain access to the features. Can the developers look at this feature and resolve?  Thx","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6497532566","version":"2.6.6","date":"2020-10-03T23:23:26.000Z","authorName":"Think7x24","rating":1,"title":"Very Frustrating","body":"I don’t know if it is a bug or you guys just change your app terms and conditions every other day. The end result is that it wipes the saved login. VERY FRUSTRATING","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6497005471","version":"2.6.6","date":"2020-10-03T19:34:50.000Z","authorName":"saveisafail","rating":1,"title":"Flawed","body":"When you purchase something like a Mercedes you expect top of the line however this app falls so short. It’s frustrating how long it takes to remote start my vehicle only to get into it and have the engine shut off the minute you open the door.If that’s not disappointing enough when you’re trying to locate your vehicle to see where you parked but it takes way too long by the time you’ve gotten the app to load you’ve probably already found your car. This app is so bad I’m surprised it even made it past production makes me scared to drive my Mercedes if they can’t even launch an app. I had a jeep and a Mustang before I bought my Mercedes and the auto start was so reliable and this does not compare it’s very underwhelming. They can’t even get the app to not log me out every time not to mention they made the switch without even telling everybody that they need to sign up for Mercedes me account so now I had to make a completely new one I didn’t even know","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6488487222","version":"2.6.6","date":"2020-10-01T13:21:45.000Z","authorName":"JamesUnleashed_","rating":4,"title":"Moderately Satisfied","body":"I like that I can start my vehicle from anywhere. I work in a building far from my vehicle so it’s perfect. My app seems like it updates once a week, which is very annoying because it logs you completely out and I have to re-log in every time I want to start my vehicle. I don’t know if it’s just my vehicle but I am unable to adjust the climate when I use the remote start feature.\n\n2017 C300 Coupe","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6486476305","version":"2.6.6","date":"2020-10-01T00:08:42.000Z","authorName":"CheatedByApple","rating":1,"title":"Not up to today’s standards","body":"App will only start the car 10-20% of the time. Loading to maps takes more than 5 minutes. Ridiculous that car turns off when I open the car. It recognizes my fob so why not stay on? Even cheap American brands keep the car running. Developers please fix issues and don’t break on the next app update.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6481778449","version":"2.6.6","date":"2020-09-29T18:09:08.000Z","authorName":"shalaway","rating":1,"title":"Logs me out","body":"Keeps logging me out everyday, fix it","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6480405498","version":"2.6.6","date":"2020-09-29T09:56:48.000Z","authorName":"Tjbechillin","rating":1,"title":"Location feature","body":"Location feature no longer gives address.  Just a map. Not good. Change it back","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6478104898","version":"2.6.6","date":"2020-09-28T16:35:21.000Z","authorName":"pete_the_maniac","rating":2,"title":"Not Compatible with iPad","body":"This app is supposed to replace My MBFS to consolidate all functionality together in one app. Good idea. Except I used to be able to manage all financing related matters on my iPad and now I can’t. \n\nMercedes Me on iPhone works fine for what it’s supposed to do. But if you’re going to take away My MBFS, which also worked fine for what it’s supposed to do on iPad, at least there should be a scale-down version of Mercedes Me so that it can continue supporting the MBFS part on iPad.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6475904673","version":"2.6.6","date":"2020-09-28T01:00:39.000Z","authorName":"1Roger Beach","rating":1,"title":"New Mercedes me","body":"Useless app. Financial fats and other info disappeared when switching to new app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6471432024","version":"2.6.6","date":"2020-09-26T17:54:15.000Z","authorName":"Olu.A","rating":1,"title":"Was not made for the user","body":"This is a bad app. Period. Mercedes stayed true to their philosophy of designing to their own needs instead of the customer’s","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6468299501","version":"2.6.6","date":"2020-09-25T21:15:26.000Z","authorName":"MaverikDS","rating":1,"title":"So much potential","body":"I rarely review apps but this one deserves it. It will not leave you signed in forcing you through the initial opening screens and agreement each time you want to use it. Once you are signed in it’s very basic and usually works as long as you didn’t need your car unlocked or started right away. It seems like there is always a few minutes between signal sent and car receiving it. Compared to other manufacturers apps there is a lot to be left desired in both functionality and features. Very disappointing for MB to think this is “the best or nothing”. This so leaves you with essentially nothing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6467886297","version":"2.6.6","date":"2020-09-25T18:24:49.000Z","authorName":"Not Working Much","rating":1,"title":"Needs Help","body":"This app doesn’t work half the time when I need to use it.  When I have been out with my dog and needed to leave my car running for her to have the air on, it was not working.  The app seems to constantly be down or be being updated which is still down for a while when you wait for the update to finish.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6467449572","version":"2.6.6","date":"2020-09-25T15:52:47.000Z","authorName":"Luis C. Alarcon","rating":4,"title":"Iwatch remote start bug","body":"When issuing a voice command through Siri to start the car remotely, Siri understands the command and asks for confirmation. When Siri asks for confirmation, an affirmative answer is still translated into a “cancel command” action. Basically Siri asks “are you sure you want to start your car?” and when I answer “Yes” or any affirmation, Siri responds “ok, I will not do it” and cancels the original command. \nIm using Siri in Spanish FYI, and it is not Siri misunderstanding the affirmation because that works fine with all other apps and commands. \n\nThanks in advance for fixing this...\n\nLuis Carlos","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6465917906","version":"2.6.6","date":"2020-09-25T05:54:08.000Z","authorName":"Amafutbol","rating":5,"title":"Mercedes Me App","body":"Always there when I need it and has not failed me yet. Worth a small initial effort for lasting reliability.\nAmafutbol","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6462957385","version":"2.6.6","date":"2020-09-24T10:12:17.000Z","authorName":"Prettygirl_bounced","rating":4,"title":"Convenient","body":"This app has come in handy as I’ve locked myself out of my house and my spare key was inside of my car. All I had was my phone so I was able to get right in my car and back into my house. \n\nSeems to automatically log me out of the app almost each time I go to use it but other than that it is great.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6462209132","version":"2.6.6","date":"2020-09-24T04:04:31.000Z","authorName":"ShitshowthatisAirb&b","rating":1,"title":"What’s the point","body":"I don’t understand the point of this new app they took away any of the useful features all you could really do is schedule a service definitely a disappointment for such a car","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6461618132","version":"2.6.6","date":"2020-09-24T00:02:26.000Z","authorName":"Jinx Lee","rating":1,"title":"Deducted money from account twice!","body":"The app itself is pretty easy to navigate however this past week I had money drafted from my account twice in 5 days. I have been paying through the app for a few months now and have never had a problem until now. I didn’t get any email of another scheduled payment and the funds had already been deducted from my bank account by the time I caught it. The customer service rep simply said “I don’t know what happened”. I schedule my payments for one time only and I am not enrolled in autopay so this makes me leery of using this app for any future payments.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6456571326","version":"2.6.6","date":"2020-09-22T15:16:27.000Z","authorName":"Apidax","rating":1,"title":"Terrible updates","body":"The newer versions now keep on logging me out without reason, taking me on and endless scroll of an EULA already accepted 3 years ago. The new screen for login is clumsy and does not trigger the password menu on the iPhone, forcing the user to manually type in his email, select “log in with Password” and THEN have access to the iPhone passwords menu. Like, really, who is in charge of UX/UI for this app? It makes no sense whatsoever. And then, the rest of the app is exactly the same as in 2017. Just go back to the old version, it was much better. Or do yourselves a favour and ask the developers for the BMW Connected app for help: they did a much better job.","voteCount":1,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6456094864","version":"2.6.6","date":"2020-09-22T12:42:35.000Z","authorName":"ksa69","rating":2,"title":"login","body":"after recent updates, app is asking me to login every 2,3 days. just annoying","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6454044919","version":"2.6.6","date":"2020-09-21T21:26:24.000Z","authorName":"tyyffubv","rating":1,"title":"Not good","body":"The last app glitched. I can’t even download the new one. It told me to try again later.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6453635490","version":"2.6.6","date":"2020-09-21T18:41:29.000Z","authorName":"rdb138","rating":1,"title":"Doesn’t stay logged in","body":"You login, you setup Face ID. Everything is working. Next day, launch the app. Read pages and pages of user agreement, start sign in process, reset up Face ID. Never ending loop. Inconvenient!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6453464602","version":"2.6.6","date":"2020-09-21T17:40:37.000Z","authorName":"MrVader","rating":3,"title":"Keeps logging me out and sign agreements","body":"Since a few months ago, the app began to constantly sign me out, disable Face ID and make me read and accept some agreement every goddamn time! I cannot tell Siri to start my car anymore and have to freaking login manually every single time I want to use the function.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6452450610","version":"2.6.6","date":"2020-09-21T12:06:36.000Z","authorName":"@vega","rating":1,"title":"App not iPad friendly","body":"If you could make an app that works on iPad to make payment would be great.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6447422237","version":"2.6.6","date":"2020-09-20T01:47:39.000Z","authorName":"JarrodT83","rating":3,"title":"Needs work","body":"Love that there is this app for my car but it consistently logs me out daily. I don’t understand why this keeps happening.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6440179575","version":"2.6.6","date":"2020-09-18T01:24:05.000Z","authorName":"Class562","rating":1,"title":"Trash.","body":"App is straight trash. Mutlibillion dollar company that provides “ luxury services and products”  can’t get an app to work.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6439421751","version":"2.6.6","date":"2020-09-17T19:38:41.000Z","authorName":"fairreviewer1234","rating":1,"title":"Fire the development team","body":"This app is very buggy. The app architecture and design could be the culprit. Mercedes should hire a new team and start fresh.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6439216955","version":"2.6.6","date":"2020-09-17T18:20:10.000Z","authorName":"BDLC728919","rating":1,"title":"Can never stay logged on","body":"The app continuously logs my account out, even after I set it at “Stay Logged In” and gives me an “error” when trying to turn on my vehicle. It’s pointless to have this app if it’s gonna keep doing that.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6439210450","version":"2.6.6","date":"2020-09-17T18:18:09.000Z","authorName":"urmarried3","rating":3,"title":"Could be a lot better","body":"Insurance companies have great apps because they need to know how you use your car. My car was stolen from my driveway and even though I had EMBRACE and got them connected to local law enforcement officers they were unable to make a case to the officers or provide a link to track my vh. The car was confirmed stolen and I don’t know why Embrace just couldn’t have made the auto unable to operate until it was confirmed recovered by the police. Embrace also needs to help educate law enforcement officers about their anti theft and tracking devices on all the new models. I live in a small town 50,000 people and was surprised that local law enforcement officers had no idea about embrace. They had never heard of it and were incapable of understanding what the program was capable of doing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6439074840","version":"2.6.6","date":"2020-09-17T17:32:21.000Z","authorName":"stop with this game","rating":5,"title":"My account","body":"I don’t want you to change my Me account. I don’t want any apps. I only use it to pay on  my account","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6438473613","version":"2.6.6","date":"2020-09-17T14:14:03.000Z","authorName":"JohnN757","rating":3,"title":"Ok why is a vehicle status not included in this app?","body":"I own a Volvo, a BMW and my GLE 350. When I open the app of either the Volvo or BMW it clearly shows me wether or not any windows, sunroof, doors or trunks are open and if the doors are locked or not. The Mercedes app shows me none of this information. Why Mercedes? why???","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6438247856","version":"2.6.5","date":"2020-09-17T13:01:44.000Z","authorName":"Axioan","rating":1,"title":"MB broke the App","body":"They decided to merge MBFS (MB Financial Services) with this app, now I can not access any of my financing information.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6437978033","version":"2.6.5","date":"2020-09-17T11:20:39.000Z","authorName":"ccttd","rating":1,"title":"Mercedes me","body":"App used to be good, but not anymore sonce they try to merge together with financial app. Face time no longer working. everyone try to do a better app for customer but Mercedes do not give a crap for ir. you want to look at statement? zoomed in and not able to move the page around to look at. piece of Junk software. whoever wanted to merge this program should get fired at one. don’t matter what the reviews said. Mercedes do not give a crap about it. Stupid sofware.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6434974913","version":"2.6.5","date":"2020-09-16T13:41:25.000Z","authorName":"Reddy Kilowatt","rating":1,"title":"Have to sign in with each use","body":"Makes me agree to Terms, log in with each use. Mercedes makes great cars, but their mobile and in car app developers are not competent.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6432579046","version":"2.6.5","date":"2020-09-15T19:22:42.000Z","authorName":"Mar414","rating":1,"title":"Annoyed","body":"I’m not happy they shut down the way I used to pay my car payment before having this up and running so I can still pay online.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6431288191","version":"2.6.5","date":"2020-09-15T11:51:40.000Z","authorName":"pcpretty","rating":5,"title":"Convenient and easy.","body":"Great App for setting up GPS!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6422266036","version":"2.6.5","date":"2020-09-12T17:51:46.000Z","authorName":"mbgla250","rating":5,"title":"Satisfied Customer","body":"This app is incredible! I enjoy the ease and comfort of managing my vehicle via my iPhone.\nThanks!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6418906820","version":"2.6.5","date":"2020-09-11T19:03:06.000Z","authorName":"entrecomputer","rating":4,"title":"Missing features","body":"The paid subscription app will lock and unlock, and locate the vehicle. That is a minimum set of paid features. If you want more of my money you can enable the remote start since I paid for the keyless starter feature. You can enable after starting the heated seats since I paid for that option also. That would be useful since it is -10 in the winter mornings. Don’t get me started on remote shutdown if my Mercedes is stolen. Just thinking, all you Mercedes experience engineers.\nThanks","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6415293840","version":"2.6.5","date":"2020-09-10T17:06:48.000Z","authorName":"mambass","rating":1,"title":"Wrong gps location","body":"Wrong gps location, customer service can not fix the problem after hours of waiting. \nI am going to leave this app after the free trial","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6415179527","version":"2.6.5","date":"2020-09-10T16:24:21.000Z","authorName":"Experienced boater","rating":1,"title":"Customer no service","body":"Have had 1 car for7 years and my other car for4 yrs.\n  Have spent 4 days an about 4 hrs. trying to get back to my Mercedes me app.\n About 6 different people have tried to activate it again ( stopped working on my and my wife’s I phone.)\n  Still waiting","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6413208580","version":"2.6.5","date":"2020-09-10T02:26:11.000Z","authorName":"Spoody1*","rating":5,"title":"Decent","body":"The app is decent. There’s a few “ kinks that need to be worked out! Sometimes when I lock my car remotely from a distance, (inside a building, etc.) it doesn’t want to open when I arrive back at the car using the key fob. It’s as if it gone to a totally different channel and doesn’t recognize the key fob! This is a serious glitch! I usually have to unlock “remotely” even though I’m standing next to the car, then enter... Very Frustrating ! Please contact me if there’s a FIX...","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6412937168","version":"2.6.5","date":"2020-09-10T00:27:29.000Z","authorName":"Thomas Chanvong","rating":2,"title":"Not very responsive.","body":"The remote start option is very unreliable.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6408093337","version":"2.6.5","date":"2020-09-08T14:50:58.000Z","authorName":"ET129","rating":3,"title":"Too buggy","body":"Having users approve terms and services every login in. Setting up Face ID means nothing because the app makes you approves t&c and login in agin and again. Love the remote start and locking features, but not the effort it takes to get there.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6404645267","version":"2.6.5","date":"2020-09-07T14:12:53.000Z","authorName":"appforcash","rating":4,"title":"Pretty Good","body":"Finance should be easier to find. Dashboard is good. \nOverall I like it.\nCan’t get out of rating loop. \nApp keeps wanting me to log in. \nAnnoying bug.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6402808940","version":"2.6.5","date":"2020-09-06T23:47:17.000Z","authorName":"Morgon's Mom","rating":4,"title":"Kimberly J.","body":"I love the remote start. During every time of the yr.  I went out to the car while my husband was still inside w the keys. It was really hot out. I was able to unlock the doors get inside lock the doors & start the car! ❤️","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6402069613","version":"2.6.5","date":"2020-09-06T18:06:45.000Z","authorName":"notcub","rating":2,"title":"Not quick or convenient","body":"Every time you guys update your app, I have to scroll through your long legal agreement and then look up my password. It’s a problem when I’m about to leave my house and I want remote start to make my car a decent temperature. Instead I end up frustrated and sitting in a boiling/freezing car. It honestly makes me wish I’d bought a Porsche Macan or BMW X3 instead. Next time, I will.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6401857915","version":"2.6.5","date":"2020-09-06T16:47:18.000Z","authorName":"wexlax732","rating":3,"title":"Reliable app with super clean interface","body":"MercedesMe is a powerful tool for any Benz owner. The start screen displays my exact AMG in an elegant and beautiful graphic. The layout is clean and easy to navigate. I can rest well knowing my AMG is safe and secure where I parked it. Push alerts are sent for changes in location, vehicle speed and engine starts. The remote start works flawlessly (as long as you have 5 gallons or more in the tank) and locking/unlocking remotely works no matter how far from the vehicle you are. \n\nMy gripes are few: the app will error out occasionally and not send lock/unlock signals if service is poor. Some sort of sentry mode like our Tesla employs when leaving the car in a parking lot would greatly enhance peace of mind. My c63s amg has plenty of cameras to make this doable without tons of added cost.","voteCount":3,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6396118722","version":"2.6.5","date":"2020-09-05T01:42:50.000Z","authorName":"Freedomrider777","rating":5,"title":"Does what I need","body":"I would say 100% happy but in spite of mention it several times they still make it in portrait mode only.  I have to look at it sideways.  Make it landscape or give us the option.  Do they think we all use pour phones to use it???????","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6384570241","version":"2.6.5","date":"2020-09-01T17:01:21.000Z","authorName":"Shondra’s IPhone","rating":5,"title":"This app was a blessing.","body":"My son was buckled in his car seat in the back seat. I put my bag in the car and closed the door. My key was left in my bag accidentally. When I realized that my key wasn't in my pocket, I tried to open the door to get my key but the door locked. I panicked. Luckily, I had my phone. I was so relieved to have this app to open the doors. I thought I was going to faint. I was so nervous because all of the windows were up. I feel like this app saved his life. Seriously. This is a true story.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6381463917","version":"2.6.5","date":"2020-08-31T18:16:57.000Z","authorName":"Dpondss","rating":1,"title":"Mercedes Finance is horrible","body":"I purchased a 2014 Mercedes. When I paid my car off I went to the DMV with my title in hand and the tech says to me they meaning Mercedes Didn’t sign. What do you mean? They need to sign here and they didn’t. This was upsetting due to the fact I had to wait two hours with a dmv appt. \n\nSo when I got a chance I called Mercedes Financing Department. I spoke to different people and they are telling to me to send the title in the mail meaning for me to take the time\nGet a stamp or go to the post office so they can sign. When I said I am a busy person they told me well you can pay $90. I’m confused  I did what I was suppose to do. Why am I paying for you to send a new title that you forgot to sign. \n\nI am waiting for a call from a manager. Let’s see how this goes.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6374328248","version":"2.6.5","date":"2020-08-29T15:48:20.000Z","authorName":"AMG734922","rating":2,"title":"Full of bugs, poor telephone support","body":"The title says it all.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6364401912","version":"2.6.5","date":"2020-08-26T22:34:27.000Z","authorName":"TJzz","rating":1,"title":"Endless loop with facial recognition","body":"Every time I log in I’m given the option to login with face recognition and every time I choose to do so. Endless loop!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6363940870","version":"2.6.5","date":"2020-08-26T19:12:06.000Z","authorName":"wont buy anothet","rating":1,"title":"Really bad","body":"Very buggy, forgets your log on information so you need to keep entering ID and password.  Very disappointing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6357753713","version":"2.6.5","date":"2020-08-25T03:02:19.000Z","authorName":"Tem508","rating":1,"title":"Terrible!  Don’t waste your time.","body":"It wouldn’t take my review without giving it at least one star, can honestly say I’d probably give it a minus star. \nAfter a week of just trying to get this app downloaded, it can’t even find my car in the garage at home. \nHard to believe Mercedes even puts its name on it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6352712945","version":"2.6.5","date":"2020-08-23T16:22:36.000Z","authorName":"bearingafish","rating":1,"title":"Worst App ever!","body":"It deserves zero stars! First cold day of the year and the app is down for maintenance, nice job guys..","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6352166762","version":"2.6.5","date":"2020-08-23T13:13:58.000Z","authorName":"sweezed not embraced","rating":3,"title":"Could be better","body":"I hate when it is dark and I need it in a hurry and it wants me to sign in. Then my password does not match","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6350090892","version":"2.6.5","date":"2020-08-22T22:36:21.000Z","authorName":"Aprelsky","rating":1,"title":"Unusable with eu cars","body":"Having U.S.A. Apple ID I can’t download app to use with my car from Europe. And this app won’t accept my vin code. The old U.S.A. app used to allow to use vin codes from Europe :/ Not really a Mercedes like attention to details","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6341545161","version":"2.6.5","date":"2020-08-20T14:45:48.000Z","authorName":"Conan the Great","rating":1,"title":"Can’t even install the app","body":"I try to install this App for iOS on my iPad, and the App Store tells me “this App requires specific features not available on this device.”","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6339200682","version":"2.6.4","date":"2020-08-19T23:34:30.000Z","authorName":"Forty Year Owner","rating":1,"title":"Why must we have to buy an new pad to perform financial tasks","body":"I cannot believe that MB would replace a perfectly working app with one that requires an MB owner to buy a new IPAD or other later device to operate as a platform for its app. I personally don’t need this for my 2016 CLA. But I digress, as another user mentioned, I have been in software and app development for over fifty years and surely would not have been able to, in my professional career, implement the replacement of an app that some deem necessary and in my case, essential to pay my note, schedule maintenance, and other features that will be taken away from me unless I purchase a device that will be compatible to the newest app. I CONSIDER IT A SLAP IN THe FACE OF AN OVER FORTY YEAR MERCEDES BENZ OWNER. Come on MB get your act together, your’e to geed for that!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6338951976","version":"2.6.4","date":"2020-08-19T21:41:51.000Z","authorName":"Comcorr","rating":1,"title":"Pathetic","body":"This is the worse app ever!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6338689435","version":"2.6.4","date":"2020-08-19T19:49:45.000Z","authorName":"the-good-servant","rating":1,"title":"Remote Start","body":"The remote start function is absolutely useless!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6323413931","version":"2.6.4","date":"2020-08-15T19:30:52.000Z","authorName":"SunnyinSC","rating":1,"title":"Can’t ever login","body":"This app used to work well. It rarely works now. In the last few months it won’t login at all. It just spins and spins but won’t go to the main page. Extremely frustrating!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6319834134","version":"2.6.4","date":"2020-08-14T21:22:08.000Z","authorName":"NaeJnz","rating":5,"title":"Love it!","body":"I love all the options the app has: gas level, lock/unlock function/location option(for when my husband takes my ride instead of his)🤣, valet options etc. I just wished I could send directions to the Mercedes me app which would be readable via the Apple Maps/Google maps.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6319536246","version":"2.6.4","date":"2020-08-14T19:18:41.000Z","authorName":"MB 4 MB 4 MB 4","rating":5,"title":"Annoyingly annoying","body":"Love the remote start feature, but like other reviewers stated, by the time it starts you are at your car! Also, now the app keeps logging me out though I have the ‘keep me logged in’ box checked. THEN I have to scroll to the bottom and accept the user agreement. EVERY SINGLE TIME! then I get to stand at my car looking like an as! As I enter my login information, hopefully correctly when it is sunny and difficult to see my screen. THEN I have to set up the gas ID yet again. WTH Mercedes??  Thought it would be so cool to not have to carry my key everywhere since keyless allows me to keep it at the bottom of my bag. If only it worked it would be the Best, but feeling like it is the Or Nothing part of the slogan.  And I had to fork over $$ to activate this nonsense.","voteCount":3,"voteSum":2,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6319518532","version":"2.6.4","date":"2020-08-14T19:11:35.000Z","authorName":"DaraSKS","rating":2,"title":"Ford, Chevy & Chrysler apps work better","body":"This app is terrible. First - it’s very limited on what it even does. Second - it only does what little it does half the time. For the past month EVERY time I log in I have to “accept the terms” and do all the setup stuff. And it’s hit or miss as to if it will actually start my car. I get frustrated with the fact that I am paying for mbrace every time this app fails. Not a Mercedes quality product whatsoever. The only thing it is consistent on is locking/unlocking the car.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6316916745","version":"2.6.4","date":"2020-08-14T04:00:30.000Z","authorName":"Jrjs0900","rating":1,"title":"Constant Issues!","body":"I expect better from Mercedes. Last week the app would constantly log you out, and each time you wanted to use you would have to accept terms of conditions and re-enter all of your information. This week once you open the app to log in, after logging in, the app cursor just spins for minutes and never lets you log in. This is such a huge disappointment. PLEASE fix!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6316226304","version":"2.6.4","date":"2020-08-13T23:29:15.000Z","authorName":"Tornesia","rating":5,"title":"World Class Customer Service","body":"I have been in Mercedes owner since 2004 and I will never leave the Mercedes-Benz family always excellent customer service and will go above and beyond for customer satisfaction thank you to my dealer Celestine for his expertise. Thank you Terry for financing and I will be back next year to get my AMG thank you!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6315852195","version":"2.6.4","date":"2020-08-13T20:56:29.000Z","authorName":"Ethan Thomas Akin","rating":5,"title":"Happy  🇺🇸😎","body":"Much improved— great on these warm August days.  Really shines in the cold Iowa winter.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6314407492","version":"2.6.4","date":"2020-08-13T13:23:07.000Z","authorName":"bobbyoh88","rating":1,"title":"Change from mbfs","body":"Garbage app cant even log me in since they killed the mbfs app just spins spins spins. The best or nothing.... today is nothing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6310722911","version":"2.6.4","date":"2020-08-12T14:27:42.000Z","authorName":"AverageParent","rating":4,"title":"Great App with little features missing","body":"This app is good. If it can provide insight into other things we could read from OBD II port such battery, engine oil, gas level, tire, etc., statuses that’d make it more worthy. Hopefully, Benz would release next update with this feature.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6310644946","version":"2.6.4","date":"2020-08-12T14:05:56.000Z","authorName":"Craxymanxxx","rating":1,"title":"Fix Your APP","body":"This app is broken please fit it. Mercedes has to much money for a crappy app!!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6307779698","version":"2.6.4","date":"2020-08-11T20:41:17.000Z","authorName":"l sky","rating":1,"title":"Constant system failures","body":"Seriously.  Driving a 100k. Car and the app doesn’t even allow you to log In when you need it.  Called a zillion times - they have no clue about apps.  Please fix this.  Doesn’t deserve a star if you keep getting. “System failure”. Be back up and running soon” message.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6307333897","version":"2.6.4","date":"2020-08-11T17:59:13.000Z","authorName":"DeanJC20","rating":2,"title":"When it works it's good","body":"I like the App, when it works. The problem is 1/2 the time when I launch it, it thinks I'm opening it for the first time and makes me accept the legal agreement and enter my username and password instead of the Face ID which I've set before. I go through this several times per week. Why can't this developer make it work like all the other apps that work properly?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6303854170","version":"2.6.4","date":"2020-08-10T21:47:29.000Z","authorName":"macbvi","rating":1,"title":"Don’t work","body":"Paid $290 for 18 months to allow remote start and it has never allowed my Vin to sync up. Have spent 1.5 hours on phone with Mercedes me and still nothing will be canceling service on the 17 gle. Odd it works fine on my other 2020 gle though.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6302619619","version":"2.6.4","date":"2020-08-10T14:15:31.000Z","authorName":"Joedc831","rating":2,"title":"Incredible","body":"With the latest update, the developers of this app have managed to take, at best, a mediocre app, and make it even worse. \n1.  Review Terms of Service every time you log in. \n2.  Manually enter User ID and Password every time you log in. \n3.  Enter PIN every time you log in. \n\nMercedes, please consider replacing whomever you hired to develop this app with someone that knows what they’re doing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6296134538","version":"2.6.4","date":"2020-08-08T20:51:05.000Z","authorName":"rstockbower","rating":2,"title":"Keeps logging me out!","body":"This worked great up until about six weeks ago. Since then, it logs me out 2-3 times a week! Deleting and reinstalling the app didn’t help.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6296056649","version":"2.6.4","date":"2020-08-08T20:17:15.000Z","authorName":"turbo_jimbo","rating":1,"title":"So useless.","body":"After an exhausting set up process, none of the features work. Most expensive car available without remote start. AMG and MB should be ashamed to put their name on this.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6296025885","version":"2.6.4","date":"2020-08-08T20:04:32.000Z","authorName":"Kingkrs","rating":3,"title":"It’s ok","body":"This app is ok. You’d think being Mercedes it would be much better and more streamlined. Latest update logs me out every time even though I click the “keep me logged in” button. Wish you could see vehicle diagnostics like tire pressure, oil life, brakes and other maintenance items. Also if the doors are locked or not would be helpful. Never understood why I can’t remote start with the key fob but only with the app?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6295371658","version":"2.6.4","date":"2020-08-08T15:51:41.000Z","authorName":"balsingh122","rating":1,"title":"Update logs me out everyday","body":"The new update forces me to log in everyday. Even when I check to stay logged in","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6293600892","version":"2.6.4","date":"2020-08-08T05:34:21.000Z","authorName":"Meowronna","rating":1,"title":"Not working","body":"Why did they mess up the other Mercedes payment App?  \nI was unable to “confirm” my vehicle on this one no matter how many times I tried. Therefore could not get into my MBFS to make my payment.  Worthless.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6292605252","version":"2.6.4","date":"2020-08-07T23:14:39.000Z","authorName":"amghammer","rating":1,"title":"Really need to improve","body":"Crap . Does not start my mercedes","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6288361542","version":"2.6.4","date":"2020-08-06T21:55:14.000Z","authorName":"Philavilla","rating":1,"title":"This app never stays logged in","body":"I might as well just go to my car and start it for the amount of time it takes to keep logging in EVERY SINGLE TIME I open this app. Multiple users report the same problem. Super annoying. And they want you to pay for this after a certain amount of time? No way. Not worth it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6284247653","version":"2.6.4","date":"2020-08-05T20:45:25.000Z","authorName":"azeckel","rating":1,"title":"App is garbage","body":"The only thing I want to use it for is to remote start my car. It works maybe 1 out of 10 times. Also, every time I open it I have to re-login. No matter how many times I click to stay logged in and enable Face ID, the next time I have to start all over.\n\nReasons remote start doesn’t work:\nLess than 1/2 a tank of gas. Really?\nNetwork error. Not on my end...\nWindows open. Uh, no they’re not.\nUnknown error. I think I know - this system is trash!\n\nNot on the app as much as the car but the 1 out of 10 time it works, remote start shuts off as soon as you approach or open the trunk. Why? It’s 130 degrees in there, why do you think I want it to shut off? I obviously have the key...","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6278490310","version":"2.6.4","date":"2020-08-04T11:03:35.000Z","authorName":"MrDevice","rating":2,"title":"Needs Lots of Work","body":"Searched high and low for a way to report bugs or submit feedback in the App, no dice. In addition to the fact that the remote start feature performs very badly, meaning it often doesn’t work, the latest App update signs you out completely quite often forcing you to sign in again from scratch. The app is already slow to load, adding the fact that now more than often you are signed out completely and it is makes the app that much more impractical to use.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6262453807","version":"2.6.4","date":"2020-07-31T08:21:55.000Z","authorName":"CobraEmpress","rating":1,"title":"Always having trouble","body":"I know for a fact that I did not forget my password \nEvery log in Was unsuccessful .\nThen after the 20th try \nI somehow got in \nBut still all links were confusing \nAnd just the whole lay out was very disappointing \nPlease update this app to make things work a little better .","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6255916766","version":"2.6.4","date":"2020-07-29T15:29:13.000Z","authorName":"yuriy zg","rating":1,"title":"Remote start doesn’t work","body":"I have GLS 550 2017. \nEach time I try the remote start it says it failed to initiate. Calling reps or reinstalling the app doesn’t work, making this app an absolute garbage.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6249227647","version":"2.6.4","date":"2020-07-27T22:32:48.000Z","authorName":"z.a...","rating":2,"title":"App","body":"I love my car but this app needs to be re established stat! It has not been working for weeks, it takes forever to start your engine, the only elements working properly is the lock and unlock buttons. Somewhat disappointed.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6246151974","version":"2.6.4","date":"2020-07-27T03:16:45.000Z","authorName":"Greggodes124467","rating":1,"title":"This is not the first time I have given them 1 star","body":"The techs writing this app must be dems bc they are not too smart.  The more they do updates the less this freakin app lets me do a remote start.  Is it really that hard?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6246027891","version":"2.6.4","date":"2020-07-27T02:25:41.000Z","authorName":"mevawalla","rating":1,"title":"Highly unstable, consistently bad","body":"I’ve had my Mercedes for three years now and throughout this tenure this app has been dismal. Frequent interruptions in service, lost passwords, random crashes. Just dreadful.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6245427059","version":"2.6.4","date":"2020-07-26T22:14:37.000Z","authorName":"Mark Blaze","rating":1,"title":"It hardly works","body":"Its sad Hyundai has a better app for their cars , this app has been glitchy for years and they never approve on it . This app works when it wants , the remotep  but no start and the vehicle locator works on occasion . Mercedes could do better then this .","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6244847644","version":"2.6.4","date":"2020-07-26T18:07:34.000Z","authorName":"Environment BioMan","rating":1,"title":"If this is “The Best or Nothing” then I’ll take nothing!","body":"This app is so unreliable that it’s virtually useless!  Any good Class Action lawyers out there could have a field day with this feature/product.  Get AHEAD of the curve on the technology stuff Mercedes... haven’t you lost enough market share to Tesla?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6242479283","version":"2.6.4","date":"2020-07-26T03:43:17.000Z","authorName":"Beliyagua2737","rating":1,"title":"Ipad pro 11in no cellular, cant download!!!!!","body":"Seems like IT forgot one device....... i know i can use other options to pay, but i think we can agree thats not the issue!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6241145819","version":"2.6.4","date":"2020-07-25T18:20:08.000Z","authorName":"JD plano","rating":1,"title":"Cannot open app after new version -","body":"Cannot open app after recent version.  Need to do much better testing!\n\nHave tried deleting the app and reloading from the App Store.  Still doesn’t work.  The hottest part of the summer when I need the mobile app to work for remote start.  Worthless!  Seriously considering switching to Tesla or another luxury brand.  Mercedes has lost their edge.\n\nUpdated - 7/25/2020\n\nVery excited.  Bought a Tesla.  Good bye Mercedes.  Used to be a great brand.  No longer.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6237883997","version":"2.6.4","date":"2020-07-24T22:55:26.000Z","authorName":"Frankie VII","rating":1,"title":"Needs to work better","body":"Why does this app never save your password? Enter your email address and password every time you want to start your car? It would remember it. It makes you read all the terms and conditions every time you open the app and then re-enter your information even if you have checked the remember me box. Super annoying.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6237002215","version":"2.6.4","date":"2020-07-24T16:59:41.000Z","authorName":"vote4gop","rating":1,"title":"Back to multiple logins needed","body":"Once again, a new update causes me to have to agree to terms and re-enter email and password. Fix it please!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6236837983","version":"2.6.4","date":"2020-07-24T16:04:10.000Z","authorName":"GLes Wee","rating":5,"title":"No iPad App?","body":"Can not find the app for iPad.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6228674767","version":"2.6.4","date":"2020-07-22T15:52:29.000Z","authorName":"techsurf4","rating":1,"title":"Unreliable = liability","body":"Net/net:  Door locks and location fail frequently.  Regardless of other “bells/whistles”... THIS is a serious issue.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6223835425","version":"2.6.4","date":"2020-07-21T12:28:47.000Z","authorName":"WendyPuck2657777092794","rating":1,"title":"App is broken","body":"I received an email saying I had to change to the new MercedesMe app.  So I followed the link and installed the app.  Well, I can’t get past the login screen.  It shows my car, asks me to confirm and when I click “confirm” the screen blinks but nothing happens.  It’s frozen.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6221984920","version":"2.6.4","date":"2020-07-21T00:45:46.000Z","authorName":"JacobFerg","rating":2,"title":"Needs work","body":"This app has nice features, but has a lot of bugs. The most annoying is it requires me to sign the online agreement and login every time. So when you want to remote start the car but have to stop for 30 seconds just to get into the app, then 10-45 seconds more to send the signal to your car, it feels like a waste. This service is not cheap if you have to pay for it, and until they fix these bugs it’s not worth it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6219945127","version":"2.6.4","date":"2020-07-20T12:09:01.000Z","authorName":"fonta2222","rating":1,"title":"App login information","body":"Each time that you have to use this app you are asked to read through this lengthy term of use agreement and then accepting. Before, once you signed the term of use agreement you are not ask to do this anymore and you can just go in straight to the login page. This update is absolutely ridiculous. Also, the apps ask you if you want to login using FaceTime ID every time you try to use it even when you checked the stay connected box.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6217918457","version":"2.6.4","date":"2020-07-19T22:19:42.000Z","authorName":"Ray$$$$$$$$$$$$$$$$$$$$$$$$","rating":1,"title":"When it works it is decent","body":"Ever since the version 2.6.4 updated on 7/15/2020 the app has been hit or miss. Never keeps you signed in. Always have to agree to terms. Sometimes it says system error. Also remote start works 50% the time. Also it is VERY VERY slow if it does work. If you use the siri shortcut command to start your car it works 25% of the time. For a company that's sells very high prices luxury cars that supposed to be great quality. This app is CRAP. MB you really need to work on this app!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6215686453","version":"2.6.4","date":"2020-07-19T08:27:20.000Z","authorName":"adlezama1909","rating":1,"title":"Unreliable","body":"All of a sudden, it stopped working last week. It doesn’t even load. All it says is system error, we apologize.  And now I see the announcement that the MBFS app will be discontinued in September. They push everyone towards this app and it doesn’t even work. Mercedes-Benz should be ashamed of the service this app fails to provide.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6212674794","version":"2.6.4","date":"2020-07-18T13:13:19.000Z","authorName":"Manny Rosas","rating":1,"title":"Embarrassment.","body":"Remote start works 60% of the time. App is SLOW. And it makes me sign in every single time you open it. Horrible glitch. Horrible App.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6210388894","version":"2.6.4","date":"2020-07-17T22:37:23.000Z","authorName":"new benz 12543","rating":2,"title":"Remote start","body":"I like the idea of the app\nBut have had many issues with the remote start \nIt’s 80/20 if it actually works\n80 being the % it doesn’t work","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6210304288","version":"2.6.4","date":"2020-07-17T22:00:27.000Z","authorName":"Rudratrivedi","rating":2,"title":"Can’t connect to finance services","body":"I tried to connect to finance services to pay and view bills it’s not getting me connected.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6207706714","version":"2.6.4","date":"2020-07-17T06:42:30.000Z","authorName":"Über Reviewër","rating":1,"title":"Remote start","body":"I have a beater Ford pickup for miscellaneous transport and off-roading, that’s a 2010, which if view is unobstructed, can start from 200 yards. Obstructed view such as walls it can remote start from at-least 120 yards. A 2020 MB should have a remote start on the key. Just sayin.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6206607638","version":"2.6.4","date":"2020-07-16T23:35:50.000Z","authorName":"Kitkatsiam","rating":2,"title":"Pretty useless.","body":"I wish it had the remote start on the key fob like my other car. At least then I could start it before I get to the car. \n\nThis app rarely loads and when it does it’s so slow!  \n\nAlso, some of us like to open our windows just a crack to ventilate the car while it’s in a hot parking lot. But of course if I do this I can’t  remote start. \n\nAlso, if I am am lucky enough to remote start, why in the heck does the car have to shut off when I unlock it? My other cars keep running and all I have to do is press the brake pedal and the start button and I’m ready to go. \n\nAll in all, I thought Mercedes could have done better.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6206394954","version":"2.6.4","date":"2020-07-16T22:05:50.000Z","authorName":"veganqueeen","rating":1,"title":"Every time I remote start my car from the app...","body":"Every time I remote start my car from my phone app (Mercedes me) I go out to my car I open the door and the car turns off? What is the point of remote starting it if it literally won’t stay on.....","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6201752040","version":"2.6.4","date":"2020-07-15T18:10:57.000Z","authorName":"Ebrown147","rating":1,"title":"Another update that does not work","body":"New update won’t even open. Seems to b a trend. Half of the updates end up useless. Would expect better from MB","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6194186639","version":"2.6.3","date":"2020-07-13T20:32:47.000Z","authorName":"Leelemak","rating":1,"title":"Don’t think I’ve had the worst app ever","body":"Come on Mercedes you could do better than this!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6190925663","version":"2.6.3","date":"2020-07-13T00:10:17.000Z","authorName":"naniwadin","rating":5,"title":"Location","body":"Love it but the location is inaccurate, it gas the right street, wrong city and zip code.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6186663986","version":"2.6.3","date":"2020-07-11T21:25:18.000Z","authorName":"I54u2","rating":1,"title":"Still needs allot of improvement","body":"App only works part of the time - specifically remote start - and when it does the latency time is way too long between pressing the start button on the app and the vehicle starting. Won’t work with less than half tank of fuel.  Shuts off when door is opened (any door). Especially annoying because there is not a remote start on the key. Locking and unlocking is semi reliable. I have waited and been patient long enough with plenty of app updates and still it is below average. My other vehicle is not even remotely in the same class as my Mercedes and the app blows this one away from features to distance. There is no comparison. Quite frankly...Mercedes should be embarrassed. I don’t say these words light either as I truly enjoy the vehicle but cmon... struggles with remote start this day in age... really?","voteCount":2,"voteSum":1,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6171351352","version":"2.6.3","date":"2020-07-08T08:39:23.000Z","authorName":"mobb1977","rating":1,"title":"Horrible","body":"They just can’t get this thing to work right. Been so long and still issues. Have to log in with e mail and password every for you want to use the app. Absolute fiasco.","voteCount":2,"voteSum":1,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6168239933","version":"2.6.3","date":"2020-07-07T13:31:33.000Z","authorName":"CWPS&W","rating":4,"title":"Security","body":"Although I think security is very important, the sign up process is a bit complicated. It would be nice if at the beginning one was informed of the requirement for information by providing a list of those that will be needed. Those information could be collected before beginning rather than scrambling to find each one during the sign up process.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6164989208","version":"2.6.3","date":"2020-07-06T17:40:55.000Z","authorName":"MarcelineOlson","rating":5,"title":"Great app!","body":"Great interface and rarely fails. \nLove it","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6158603809","version":"2.6.3","date":"2020-07-05T02:42:56.000Z","authorName":"Julsist21","rating":4,"title":"Works great","body":"It works almost all the time. The only problem is sometimes it does not work because of a window was open or gas was too low but it will be better if the will indicate the specific problem if it does not meet the criteria for remote start.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6135936161","version":"2.6.3","date":"2020-06-29T13:24:23.000Z","authorName":"Happy with my C300 Coupe","rating":5,"title":"Mercedes Me App","body":"I love this app, such as the car functions lock/unlock, engine on/off, start/stop car, ease of making a car payment etc. A must have accessory  with your Mercedes.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6134314809","version":"2.6.3","date":"2020-06-29T03:42:09.000Z","authorName":"Ms Red44","rating":5,"title":"Great app!","body":"I love that I can lock, unlock, start my vehicle and much more all from my Apple Watch! With the recent upgrade, everything works great on my GLE 2017","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6133367079","version":"2.6.3","date":"2020-06-28T21:20:32.000Z","authorName":"beatboxmaster67","rating":1,"title":"It’s certainly not “the best or nothing “!","body":"It’s lame that you have to use the app to remote start the car.  This seemed to be a useful feature here in Texas to cool the car down as you finish in a store or business.  \nYou must remember to turn the AC high when you leave the car as there’s no ability to adjust in the app.\nHalf the time it’s either very slow (over 5 minutes), or it simply doesn’t work.  Maybe they should outsource this work to Silicon Valley and get it done right!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6124652828","version":"2.6.3","date":"2020-06-26T15:57:37.000Z","authorName":"Robert Portney","rating":5,"title":"Fast and Great","body":"Bobby Portney","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6104572648","version":"2.6.2","date":"2020-06-21T14:00:13.000Z","authorName":"Rami.AlYousef","rating":4,"title":"Could be better","body":"I love this app and everything done by Mercedes! However few things (me and many others asking for) could be done better.\n\n(1) allowing the users to send an address form Apple map to the application. (2) enhancing the application performance, it’s too slow. (3) allowing the “Driving Journal” to be more than 24 hours, it’s annoying yo keep activating this feature everyday. (4) adding the “Locate Vehicle” as an icon to the top list.\n\nThanks you Benz for the amazing experience and I hope you do hear the voice of your customers.","voteCount":7,"voteSum":6,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6104513632","version":"2.6.2","date":"2020-06-21T13:41:34.000Z","authorName":"John D 3","rating":1,"title":"Unrealized Potential","body":"I have a 2017 E class. The remote start is great ... when it works. Unfortunately, it doesn’t work most of the time, although the remote lock/unlock always works. I haven’t been able to use it for 45 days or so. When I call Mercedes, they say I’m going to have to wait for an app upgrade and they have no idea when it will happen. This isn’t helping Mercedes’ reputation.\n\nUpdate June 21, 2020. It worked for a while, but now is back to not working. Sad.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6102741814","version":"2.6.2","date":"2020-06-21T03:18:55.000Z","authorName":"Abladu","rating":4,"title":"The Mercedes Me App works now","body":"I love the app now.  But to get it to work in the beginning was a struggle.  The installation process and usage, during the first few days was difficult.  It was difficult due to technical issues with the app.  But recent usage has been a breeze!  I am guessing that recent updates to the app to fix issues to get the Mercedes Me app to work, has proven to be successful.  I haven’t had any issues 3 days  after installing the app on May 19th, 2020.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6058834534","version":"2.6.2","date":"2020-06-10T12:57:57.000Z","authorName":"Eb (Saphire)","rating":5,"title":"Love It","body":"I love this App just like I love my car.\n\nI love that I can start my car, pay my bill, send address from my phone to my GPS, locate it when getting service and that if I forget to lock it in my garage I can go right to the App. \nYes I lock my car in my garage.\nFor me it provides luxury convenience.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6056729629","version":"2.6.2","date":"2020-06-10T00:32:35.000Z","authorName":"Goldenlonglegzzz","rating":1,"title":"No payment updates","body":"I paid my bill and it’s still showing that I still owe the amount. On the transaction history it shows paid but on my profile it still saying it’s due. I read the other reviews and their the same. I think this app should be sold to someone who can invest more into and shutdown for good.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6051532885","version":"2.6.2","date":"2020-06-08T17:06:42.000Z","authorName":"Bactine","rating":1,"title":"Exceptionally unreliable","body":"I’m baffled at how useless this app is. The remote start feature has been an actual help maybe once in the 18 months I’ve had the car. Every other time I tried to start the car, I got to the car and started it myself before the signal went through the app. No benefit there. The locate feature is quite slow and not worth using this app—my map application remembers where I parked all on its own. Without remote start, or the ability to open or close windows, or turn on seat heaters, check the fuel level or tire pressure, I don’t see the purpose. If the app was reliable in doing what it’s supposed to do, I could give it four stars for at least doing *something*.\n\nI haven’t seen another mobile application as unreliable as this one. I’ve worked in software development for decades. In my experience, I’d expect to be fired if I was responsible for this app.","voteCount":2,"voteSum":2,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6040672586","version":"2.6.2","date":"2020-06-06T01:50:24.000Z","authorName":"mjgvf","rating":1,"title":"I will NOT give out my social security number","body":"Seriously. To register, Mercedes Me wants my Social Security number! This is my first Mercedes and I thought it would be a better experience.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6034044952","version":"2.6.2","date":"2020-06-04T12:42:49.000Z","authorName":"Divalasha","rating":5,"title":"Good","body":"Good","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6022766956","version":"2.6.2","date":"2020-06-01T18:15:19.000Z","authorName":"Ske4","rating":1,"title":"Unreliable.","body":"This is app is absolutely awful. The remote start feature rarely works; I consistently receive an error message stating a “technical problem on our end” took place and I should try again after a few minutes. The speed alerts don’t work at all anymore, though it indicates it’s still activated. I let my teenage son drive my car so that I can monitor his driving and location more closely. But with the app being nonfunctional, it’s just pointless anymore. So disappointing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6010657781","version":"2.6.2","date":"2020-05-29T20:38:05.000Z","authorName":"Mattz2010","rating":1,"title":"Rarely Works","body":"I don’t know if it a problem with their app or with their connection to the car but it starts the car about 20% of the time. The other 80% it fails. I would rather have a remote start on my key fob than this worthless app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6009446066","version":"2.6.2","date":"2020-05-29T14:10:02.000Z","authorName":"WTLLUC","rating":4,"title":"Pretty good!","body":"Love the app, however there are a few things I wish it had... love to be able to lock and unlock car.  So many times I lay in bed before I go to sleep and think did I lock the car? Nice feature not to have to get out of bed and go downstairs.  I like the auto start but I wish it wouldn’t shut off when I get to the car.  That is super annoying.  I like ai can check my bill and pay from the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6007156079","version":"2.6.2","date":"2020-05-29T01:11:58.000Z","authorName":"Michael David Morrison","rating":1,"title":"Apple Watch","body":"Does not install.   Useless app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"6003234248","version":"2.6.2","date":"2020-05-28T04:21:20.000Z","authorName":"Kukugege","rating":1,"title":"Can’t remote start after recent update","body":"Can’t remote start after recent update, plz fix","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5997671838","version":"2.6.2","date":"2020-05-26T20:47:06.000Z","authorName":"Aetheron369","rating":1,"title":"This app is crap","body":"Like the title says, this is absolute crap. Pure and high quality cow dung. I can’t believe this is coming from a car maker like Mercedes. How on earth do they not see that this is destroying their brand? Un-freaking-believable. SMH","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5980655555","version":"2.6.1","date":"2020-05-22T20:44:11.000Z","authorName":"HunFarlow1","rating":1,"title":"Remote starts","body":"Remote starts never works since I bought it new 2019 suv","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5967067094","version":"2.5.4","date":"2020-05-19T19:47:35.000Z","authorName":"Glynn0331","rating":1,"title":"The app is not working","body":"Every time after I login, it will automatically shutdown the app! Then I'll never can open the app at first place. I have to delete it and re-download it, and after you login, it shutdown again, then it's another round that you can't even open the app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5966690966","version":"2.5.4","date":"2020-05-19T17:46:12.000Z","authorName":"Moniquiqui21","rating":1,"title":"Terrible","body":"I downloaded this app a few days ago and I haven’t been able to open it. I’ve been trying everyday and when I press on the app to open it and crashes and never opens. What a waste.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5961373239","version":"2.5.4","date":"2020-05-18T14:07:40.000Z","authorName":"Red Hot Ree","rating":1,"title":"App doesn’t open","body":"My husband just purchased my first Mercedes Benz for my birthday. This app won’t open. I’ve uninstalled it, powered my phone on and off and have been unsuccessful. I always thought I would be in an Elite class having a Benz...my Chevy app for my Camaro was way better ijs","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5952575054","version":"2.5.4","date":"2020-05-16T11:04:35.000Z","authorName":"Aeb737","rating":1,"title":"Welcome to Mercedes... NOT","body":"The app will not open. It tries to open but then crashes after 10 seconds. Not the best way to introduce the brand to a new customer. Please fix ASAP","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5942459713","version":"2.5.4","date":"2020-05-14T02:42:02.000Z","authorName":"Liz5650","rating":2,"title":"I loved this app for years, but....","body":"It just updated itself and I had to re-link everything again.  I am stuck in the final step of setting my preferred dealership.  I enter my zip code, select my city, and I get the message “No results to display.”  I cannot get past this screen, so now app is suddenly useless.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5941644022","version":"2.5.4","date":"2020-05-13T22:05:49.000Z","authorName":"Tampateh","rating":1,"title":"Won’t even load","body":"I can’t criticize the app beyond it failing to load every time I try to do so. I would appreciate the opportunity to see how it functions — or doesn’t, but I can’t get that far with it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5934617261","version":"2.5.4","date":"2020-05-12T06:29:32.000Z","authorName":"PilotJimmyLin","rating":1,"title":"Keep crashing","body":"Since I downloaded it, logged in my account \nThen keep crashing, how come a luxury brand make a stupid app like this.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5932272174","version":"2.5.4","date":"2020-05-11T16:39:09.000Z","authorName":"mercedes shame","rating":1,"title":"The worst!","body":"The app still not working. Having been able to start my car in months and no fixes on Mercedes side because they just don’t seem to really care to fix it or know how to fix it. Do not pay for this service when you buy your Mercedes or don’t pay for service after your free trial. You will be disappointed. You’ve been warned.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5931846768","version":"2.5.4","date":"2020-05-11T14:29:04.000Z","authorName":"DesertPain","rating":5,"title":"Map is Marvelous","body":"My favorite feature is where I input my destination’s address.  The screen shows my path to the destination.  I love the feature that shows if a lane goes forward or if it’s a turn lane at intersections.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5924433887","version":"2.5.4","date":"2020-05-09T18:03:47.000Z","authorName":"B. Brown","rating":1,"title":"Crash","body":"The app keeps crashing and can’t even login to use any of the features.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5920209575","version":"2.5.4","date":"2020-05-08T18:18:07.000Z","authorName":"Fun Tyme84","rating":5,"title":"Poor app","body":"App is not working please fix","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5917109146","version":"2.5.4","date":"2020-05-08T01:43:29.000Z","authorName":"MellyMel4ever","rating":1,"title":"Crashes upon signing in","body":"Completely trash app. Useless! I was excited about using it too. My new GLB 2020 has all the bells and whistles and the app crashes once I sign in. Fix it please!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5916107419","version":"2.5.4","date":"2020-05-07T19:55:20.000Z","authorName":"tainanna","rating":5,"title":"Worry free","body":"I have had a wonderful experience with the app which gives me peace of mind and convenience especially now with Covid-19. No kinks. Just saying.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5913066280","version":"2.5.4","date":"2020-05-07T03:53:29.000Z","authorName":"Matt Stallings","rating":1,"title":"Thank you","body":"Just bought the 2020 GLA brand new off the lot. They push the app. I get excited and feel cool. I download the app. App crashes every single time I try to open it on my iPhone. What is this? How can you have an app this poorly designed and optimized? I wish I could see what the app has to offer but I cannot even get it to open. Thanks Mercedes for the false hope.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5893767571","version":"2.5.4","date":"2020-05-02T16:14:59.000Z","authorName":"few active paying members","rating":1,"title":"Terrible quality","body":"Constantly crashing.  Hard to use.  Disappointing app from such a great company.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5886334623","version":"2.5.4","date":"2020-05-01T01:30:54.000Z","authorName":"acascino91","rating":1,"title":"Doesn’t open, no updates...","body":"Everyone complaining it doesn’t open, yet it hasn’t been updated in 2 months. This doesn’t really make sense! Can’t even get my new car connected.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5879609072","version":"2.5.4","date":"2020-04-29T13:00:41.000Z","authorName":"Joeyoh57","rating":1,"title":"Has never successfully loaded","body":"Every single time I have attempted to launch the app, it crashes after the sign-in screen. After multiple deletions and redownloads this still happens. Absolutely worthless app","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5879274062","version":"2.5.4","date":"2020-04-29T11:25:00.000Z","authorName":"My Mo and Mia","rating":1,"title":"Are you going to fix this? 3 month now! It’s ridiculous!","body":"Unfortunately, I have not had a good experience so far.\n\nIn February 2020 I purchased a new GLB250 and I loved the car. However, I cannot to get the Mercedes Me app connected as it will not accept the VIN. After at least a dozen calls to support, and with the case escalated to “the highest level,” I got nowhere. I called the dealer, Mercedes of Winter Park, and I spoke with at least 4 people. I even left the new car with them for three days. They found nothing and fixed nothing.\n\nTWO MONTH’S later, all communications have ceased, I have been ghosted, both by the dealer and Mercedes Me support and the problem is STILL unresolved.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5876529878","version":"2.5.4","date":"2020-04-28T19:57:02.000Z","authorName":"Antonio Carlo Gambino","rating":1,"title":"MB-WORTHLESS-MB","body":"I just purchased a Mercedes-Benz B250e. Nice car but doesn’t go very far on a single charge. So I am told there is an app to help monitor the car, charging and so on. This app is the one that works with my almost 3 year old car. I downloaded it and followed through with the registration process that included having to sign up for a $350+ subscription...but like my Tesla the fees were similar so I went forward. Now I find the app doesn’t have any helpful information or use ; the app is extremely basic and is virtually useless. I have called Mercedes-Benz numerous times and they are useless. There is also another app they have, “My Mercedes Electric” but it is web based and Mercedes-Benz has apparently stopped supporting the app/web link. So, out of luck. Had I known Mercedes-Benz abandons their customers like this I would have passed on this pretty little car and bought another Tesla. I am not happy and I am not finished with Mercedes-Benz on this problem. Round up your attorneys boys...I am on the way.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5875890999","version":"2.5.4","date":"2020-04-28T16:32:35.000Z","authorName":"FLIP JEE","rating":5,"title":"Mr. Flip","body":"Unlocking and locking doors wonderful. Reminding me my location","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5874270890","version":"2.5.4","date":"2020-04-28T08:31:39.000Z","authorName":"orbj","rating":1,"title":"Ludicrous Embarassment","body":"This app is painful enough to make you not buy a mercedes. Has all the hallmarks of an app where executives decided to outsource it to a 3rd party and picked the cheapest bud. Get it together. Do what you have to do to make it functional. Terrible product. Abysmal effort. This has the feel of an app that some executive’s nephew coded over the summer before getting bored and abandoning it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5871204199","version":"2.5.4","date":"2020-04-27T15:15:51.000Z","authorName":"Nikki2084","rating":1,"title":"Doesn’t work","body":"The app shuts down every time I try to use it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5855540972","version":"2.5.4","date":"2020-04-24T03:14:35.000Z","authorName":"BJAndr1","rating":1,"title":"Crashes","body":"When I try to login the app crashes. I’ve deleted and reinstalled and it still doesn’t let me login. This app is terrible.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5855153757","version":"2.5.4","date":"2020-04-24T01:15:43.000Z","authorName":"888664763","rating":1,"title":"CRAP... isn’t even the right word..","body":"If I could I would give this a 0 star. The app simply is so slow, and dated. The remote start doesn’t work. Lock and unlock doesn’t work. Nothing works and they want you to pay 200$ a year. SAVE YOUR MONEY!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5850807898","version":"2.5.4","date":"2020-04-23T02:46:00.000Z","authorName":"n6e2","rating":4,"title":"I don’t really use it much","body":"In fairness to Mercedes, I have a 2014 truck. There simply aren’t that many uses. I can’t start the car remotely. But the app did once unlock the car for me in the rain when I couldn’t find my key. \n\nIt’s good for making the car payments. I like the concierge service although I rarely use it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5849206155","version":"2.5.4","date":"2020-04-22T18:05:39.000Z","authorName":"Mr. Marg","rating":1,"title":"Keeps crashing","body":"Just downloaded, and it crashed from the first time and keep crashing","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5848191448","version":"2.5.4","date":"2020-04-22T13:27:48.000Z","authorName":"paolo011","rating":1,"title":"This app cannot compare to Tesla’s app","body":"The MercedesMe app is so disappointing. Not only does it not have any new features, but it’s unable to do even the simplest features like setting interior HVAC temperature. It doesn’t even work right half the time. Tesla’s app on the other hand is flawless. It allows you to turn on heated seats, defroster, change hvac temperature, open and close doors, vent and close windows, etc. \n\nMercedes has done nothing to add new features to their app in 2.5 years. I guess the newer cars get a better app?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5841342690","version":"2.5.4","date":"2020-04-21T02:08:23.000Z","authorName":"Ron G Wagon","rating":1,"title":"I didn’t know an app can be this awful!","body":"Awful job Mercedes! Do something about it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5829403251","version":"2.5.4","date":"2020-04-18T12:18:21.000Z","authorName":"PinkLeisa","rating":1,"title":"WON’T EVEN OPEN","body":"One star is pretty generous for an app that won’t even open. Can’t review any of the features since I’ve never been able to access the app. Extremely disappointing for a brand like Mercedes.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5821692431","version":"2.5.4","date":"2020-04-16T21:49:41.000Z","authorName":"jlz123456789","rating":1,"title":"Junk for the price of a Mercedes!","body":"Step it up! I expect more than this junky crashing app when i spend 60k on a car. How embarrassing for MB. They Cleary did not hire good programmers. Maybe they should pay someone externally to create an app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5821460460","version":"2.5.4","date":"2020-04-16T20:34:34.000Z","authorName":"cczach","rating":1,"title":"Doesn’t work.","body":"Ridiculous. Doesn’t even open. Crashes before you can even look at it. Didn’t matter how many times you reinstall it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5814563075","version":"2.5.4","date":"2020-04-15T10:53:43.000Z","authorName":"kiercam","rating":1,"title":"Terrible","body":"9 times out of ten doesn’t work because “technical issue on our end”","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5809901228","version":"2.5.4","date":"2020-04-14T11:49:39.000Z","authorName":"Bill 4555","rating":1,"title":"This App is a Disaster!","body":"You would expect that with the price you pay and MB’s world class engineering, this would be a first class app. Hardly the case. It works properly maybe 1 out of 3 times. The remote start feature is unreliable. That really hurts when it’s 10 degrees outside. If you want an app which works, get a Hyundai. I’d give the app no stars if I could.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5809839378","version":"2.5.4","date":"2020-04-14T11:31:38.000Z","authorName":"juat em","rating":1,"title":"No wonder is free for 36 months","body":"I was excited to use this free complimentary service until I found out how terrible this app is.  Crash, crash and crash, it won’t even open.  Seriously, Mercedes, is this why you give 3 years free complimentary.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5809233955","version":"2.5.4","date":"2020-04-14T08:19:19.000Z","authorName":"sjmistry","rating":1,"title":"Very low quality app","body":"I have tried to use the different Mercedes apps (why are there different ones and not only one?). I could not make any of them work reliably. Quite ironic, since their cars are amazing! Step up your app game Mercedes haha","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5808098679","version":"2.5.4","date":"2020-04-14T02:08:16.000Z","authorName":"Asda100","rating":5,"title":"Owner","body":"Well improved app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5799303032","version":"2.5.4","date":"2020-04-12T05:02:07.000Z","authorName":"Mercedas Tika","rating":1,"title":"Bad app","body":"The app keeps crashing and I am not able to use it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5798414447","version":"2.5.4","date":"2020-04-12T00:27:39.000Z","authorName":"LL&A, inc.","rating":3,"title":"Remotely","body":"Remote start works sometimes not reliable. Works when it gets ready. No bugs but bears. Bad, bad app.  Glad the car works a lot better then this app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5788725900","version":"2.5.4","date":"2020-04-10T02:20:09.000Z","authorName":"tc_sting","rating":1,"title":"App crash","body":"Can’t use app, crashes right after login . No amount of re install fixes it. Unusable","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5788576151","version":"2.5.4","date":"2020-04-10T01:41:53.000Z","authorName":"Macinater","rating":1,"title":"Total garbage!","body":"I wrote a review two years ago on how disappointed I am with this app. I’m still having problems after talking to customer service. I’m lucky if remote start works three out of ten times.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5783546099","version":"2.5.4","date":"2020-04-09T01:21:49.000Z","authorName":"fed up with overpriced junk","rating":1,"title":"Junk","body":"Constantly crashing \nHeaded to BMW. \nThis is unacceptable.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5783089816","version":"2.5.4","date":"2020-04-08T23:11:49.000Z","authorName":"Pr@s12","rating":1,"title":"Issues all the time","body":"Having to login all the time, not sure why it logs me out every single time for no reason. Also asks me to accept the agreement.\nAnybody seriously paying attention here? 😒","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5774803870","version":"2.5.4","date":"2020-04-07T07:59:28.000Z","authorName":"astoshiax3","rating":2,"title":"Car shuts off when you open the door.","body":"Every time I use the app to start my car the engine shuts off once I try to open the door. This is silly and makes no sense. If the car is locked and started and the owner with the key unlocks the door why should the engine turn off?? I mean it guess it’s better then nothing but I am highly disappointed. There are other features on the car itself like not being able to lock it while it’s running that seem dumb to me as well. My old car was a Nissan and I feel like some of the features involving locking and keyless entry worked better on my Nissan then my Benz which is 2 years newer. Mercedes needs to step up their game....","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5771593193","version":"2.5.4","date":"2020-04-06T15:42:56.000Z","authorName":"StephenWoopDeeDoo","rating":1,"title":"App crashes constantly","body":"Can’t get past the first page","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5768204929","version":"2.5.4","date":"2020-04-05T22:47:30.000Z","authorName":"Aalvine","rating":2,"title":"Not a good app","body":"Not Letting you start  the car because of low gas 3/8 tank is ridiculous it only Let’s the car run for 10 minutes anyways and half the time the app has an error and can’t connect with the car and my windows and sunroof error is wrong because they are closed.  For a Mercedes app it’s pretty crappy.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5763240332","version":"2.5.4","date":"2020-04-04T22:10:07.000Z","authorName":"Alfred Alexander","rating":1,"title":"Should run better for brand of car","body":"App keeps crashing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5762049945","version":"2.5.4","date":"2020-04-04T16:22:59.000Z","authorName":"Brian J F","rating":1,"title":"Sub par performance","body":"Very surprising how far behind the competition this MB app is. I am lucky if the car starts 10% of the time using the app. Seriously thinking an aftermarket remote starter would be worth the cost.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5759177713","version":"2.5.4","date":"2020-04-04T04:01:59.000Z","authorName":"Dnskalqkkcisnqnejixjsnqshciej","rating":1,"title":"Doesn’t even open","body":"What kind of app is this? After spending almost a $100,000 for a car, you’d think Mercedes would take its app seriously. Wow. This is garbage.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5754820999","version":"2.5.4","date":"2020-04-03T08:11:40.000Z","authorName":"Br__an","rating":1,"title":"Terrible Quality","body":"This app ALWAYS freezes. Every time I try to use it to unlock/lock or turn on/off my car, the app takes for ever to open. By the time I get to my car, open the app, I could of saved time by looking for the keys instead. The only good thing about this app is that I can make my car payments without calling customer service or sending a check through the mail. \n\nEmails & customer service always say they are fixing the issues but they never have come to an accomplishment.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5752716682","version":"2.5.4","date":"2020-04-02T21:07:59.000Z","authorName":"dontwasteyourtimeonNBC","rating":1,"title":"What a waste","body":"It is truly unfortunate that the reviews on this app are correct. Not only can I not manage my vehicle from the app, but the app doesn’t even open without crashing in the process! I have deleted it and reinstalled it three times. How do I make it work? This is shameful for a luxury vehicle.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5744464312","version":"2.5.4","date":"2020-04-01T06:27:54.000Z","authorName":"Payel R","rating":1,"title":"App crashes","body":"The tech on my 2020 GLA is like putting office 1995 on a new MacBook. I have the other Mercedes Me app (why are there two?) that turns on my engine. This one I had to download to pay my car bill and crashes every time I try to open. I tried it a month ago originally when I bought the car. Didn’t work. Figured I’d give it some time. Month later, same problem.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5732560755","version":"2.5.4","date":"2020-03-29T20:59:00.000Z","authorName":"Nikkklxop","rating":1,"title":"Worst app ever","body":"It’s never consistent. Always under some sort of system error. For Mercedes I expected better than this.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5728862373","version":"2.5.4","date":"2020-03-29T02:52:59.000Z","authorName":"ryslegit","rating":1,"title":"Useless","body":"App crashes upon start up.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5722597332","version":"2.5.4","date":"2020-03-27T19:38:57.000Z","authorName":"Fasttrack2","rating":1,"title":"Crashes","body":"Every time I click this app it crashes, I have deleted it twice and still the same outcome.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5721131822","version":"2.5.4","date":"2020-03-27T13:14:49.000Z","authorName":"Liesl Winter","rating":1,"title":"Luxury car, horrible app.","body":"This app glitches so much I still haven’t even been able to use it. I would love to remote start, but neither this app or the Me Connect app (why are there 2 apps to begin with??) can seem to perform this main function. Really dissatisfied and disappointed.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5719170617","version":"2.5.4","date":"2020-03-27T03:37:02.000Z","authorName":"Kwaerrrrrr","rating":1,"title":"Horrible experience","body":"The app keeps on crashing","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5718292371","version":"2.5.4","date":"2020-03-26T23:23:51.000Z","authorName":"Indiana228","rating":1,"title":"Still awful and worthy of ZERO STARS","body":"I wrote a review about 6 months after this version of Mercedes Me came out and it was not good then, it’s not good now. Luxury car, with a luxury price tag and even Dodge has a better app. The older version of this when it had the orange and white logo was muuuuch better. Worked every time. It’s weird that you can’t open the door without the car shutting off, even though you’re standing right there with your keys in your pocket. My tank is only 15 or so gallons, and once you get to 1/2 a tank, it won’t let you start the car. Even Dodge will let you start the car as long as your fuel light isn’t on. It’s not like the car will run out of gas if it’s designed to shut off when the fuel light comes on.  This app most always has some error. Can’t start car due to technical difficulties. Can’t start car due to app difficulties. Can’t start car because of connection difficulties. Cant start car because I only have half a tank of gas. Can’t start car because the sunroof is cracked open. Can’t start car because the doors aren’t locked. Can’t start car for a myriad of reasons. The app is super slow and you’re better off adding an after market remote start than relying on the app.\n\nI just want to know, which Mercedes me employees are getting on here and rating it 5 Stars??? Because it sure isn’t written by any consumer. \n\nSTOP RATING YOUR OWN APP AS GREAT! THE PUBLIC HATES IT AND YOU NEED TO FIX IT!!!!! \n\nWe paid way too much for these cars to have a problem that not even Dodge has.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5698673165","version":"2.5.4","date":"2020-03-22T23:26:43.000Z","authorName":"IHopeThisNickIsUnique:-)","rating":1,"title":"Get your sh** together","body":"The app is an absolute embarrassment for the Mercedes brand. After the initial free mercedes me period there is just 0 incentive to pay in order to continue to use the service. Not sure why version after version they don’t get it properly to work.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5687758312","version":"2.5.4","date":"2020-03-20T16:27:25.000Z","authorName":"BuddyPat","rating":5,"title":"Echo","body":"Just want to echo most of the sentiments of “blak..” \nSeems the program was an afterthought; strange from the “best car company in the world”.\nMy wife and I use the remote lock to be able to leave our dog in the car with it still running -( yes, you can lock it remotely, and your pet will remain in A/C comfort), but when you come back to your car, it will not open by placing your hand on the door handle. You have to unlock it remotely. Seems it should open by sensing the keys in the vicinity.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5684145408","version":"2.5.4","date":"2020-03-19T23:18:12.000Z","authorName":"Bishopklr","rating":2,"title":"When it works","body":"The app would be better if it didn’t experience technical difficulties 60% of the time.  It’s cool, however, when it works.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5677614838","version":"2.5.4","date":"2020-03-18T14:36:04.000Z","authorName":"Worst tv app in history","rating":1,"title":"Most consistent and reliable app ever!","body":"The app crashes after I put in login info so I have been unable to experience just how crappy the rest of the app is.  Tried deleting and re-installing 3 times now and it crashes at the same exact point in the login process. Incredibly consistent and reliable!  Not sure what others are talking about re: this app being unreliable...","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5671028050","version":"2.5.4","date":"2020-03-17T04:06:09.000Z","authorName":"OvenSearedLamb","rating":1,"title":"Garbage.","body":"App doesn’t even open. Crashes on the startup screen.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5659328446","version":"2.5.4","date":"2020-03-14T12:02:14.000Z","authorName":"Mzdrea629","rating":5,"title":"Door sensor to lock/unlock doesn’t always work","body":"More times than I’d like to admit, the sensor does not detect my hand when opening or locking the door. I’m there like an idiot waving my hand and touching the door handle in every way and nothing happens.  I have to get key fob out my pocket or bag, which is always on me and within range, to unlock or lock the doors. Very annoying when you expect it to lock/unlock immediately and it doesn’t and you’re stuck outside freezing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5658599823","version":"2.5.4","date":"2020-03-14T08:30:02.000Z","authorName":"SkutnRN","rating":1,"title":"Literally useless","body":"Why? Because I’ve never had a chance to use it due to it repeatedly crashing.  I’ve deleted and reinstalled and tried on other devices with the same result.  I’m over it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5652410330","version":"2.5.4","date":"2020-03-13T00:49:48.000Z","authorName":"dhafiz","rating":1,"title":"Update is DOA. Worst luxury vehicle app in the market.","body":"The March update is DOA. Doesn’t get past the login screen, and crashes every. single. time. Mercedes, this is shameful - you have the worst app and worst update history in the luxury car market today - speaking as a Volvo, Tesla and BMW owner. Scrap this framework, and build this again from scratch with a new dev team that is actually funded and supported to do good work instead of cheap outsourced labor. \nDon’t download this app - it is incredibly frustrating and will ruin the “experience” of being a Benz owner.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5649675890","version":"2.5.4","date":"2020-03-12T10:34:11.000Z","authorName":"Mport5150","rating":1,"title":"Mercedes app team - what are you doing?","body":"Update Mar 2020:  I received notification that a new version of the app was available. Knowing how bad the last version was I jumped on downloading the new version asap.  After logging in the app crashed immediately. I tried opening it again... crashed!   Mercedes app team - what are you doing?  You guys should be ashamed of yourselves for delivery such a pitifully low quality product. \n_________________\n\nFeb 2020:  Ditto to everything said on this post. The app is an unreliable mess without addressing the items that customers eat. Where is Mercedes response? Are they even reading this?  We may be sharing our concerns for nothing😡","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5649568700","version":"2.5.4","date":"2020-03-12T10:02:24.000Z","authorName":"Ajay379","rating":1,"title":"Disappointing for a luxury brand","body":"This is my first time reviewing anything. I could not hold back on this. For a brand with the motto “the best or nothing”, this app is a total disappointment. I mean of all the automotive brands out here, how can a whole Mercedes serve uncooked product to its customers! All the error messages that pop up when I try to remote start my vehicle about my windows or sunroof being open while everything is completely closed! \nAlso, the 5gallon gas level is ridiculous. 10mins does not take 5gallons. Come on Mercedes!\nThis is my first Mercedes, probably gonna be my last considering the experience from this app and considering that I pay almost $300/yr to use this app, I expected more out of it. I mean my friends remote start their Kia, Hyundai and even dodge perfectly fine and more reliably than I can start my Mercedes. And they do it for free!!!! What is the purpose of remote starting my vehicle to preheat or cool from my phone if I cannot set the temp from my phone?? I hope the engineers of this app do something to fix these problems. People are disappointed with this current app!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5647458879","version":"2.5.4","date":"2020-03-11T21:45:03.000Z","authorName":"wrr97","rating":1,"title":"Ultra Lento e inconsistente","body":"Estuve una hora tratando de entrar mi data y al final se cerró y no pude usarlo mas. Borré el app, volví a empezar y ocurrió lo mismo en tres intentos. A la tercera vez pude al menos entrar algo de mi data pero se congeló y no pude hacer nada más. Es un app ultra lento, inconsistente y desesperante.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5646678111","version":"2.5.4","date":"2020-03-11T16:41:30.000Z","authorName":"ihatekblmpass","rating":2,"title":"Report crash for biometric login and infinite spinner","body":"Installed the app, entered login credentials and logged in successfully.\n\n1. It gave me an option to enable Touch ID for login. On choosing this option app starts crashing.\n\nHad to delete the app and reinstall again, this time I skipped enabling Touch ID. Was able to see app home screen/ dashboard successfully.\n\nPlease fix this bug ASAP.\n\n2. Tried adding preferred dealer, my location (zip) was prefilled . However I was not asked for location permission by app.\n\n3. Add Preferred dealer screen with prefilled zip code showed an infinite loading spinner. And did not do anything for over 2 minutes.\n\nThough there is a Mercedes me connect app, please fix the above issues in USA app too.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5643280628","version":"2.5.4","date":"2020-03-10T22:56:47.000Z","authorName":"greekjamaican","rating":5,"title":"Awesome Services","body":"I spoke with Brittany and she was able to help me by providing the top security services. All this time I didn’t realize they offer this. I explained to her that someone has been vandalizing my vehicle and have a pretty good idea who it is. With no proof like a camera there is no way I can get this person. She reassured me that if someone tugs, bang, kick etc that will sound the alarm and a text will be sent to my phone. I was happy about that because I can actually make the decision on if i want to call the police.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5639054759","version":"2.5.4","date":"2020-03-10T00:34:41.000Z","authorName":"qwwwwsas","rating":1,"title":"Trash app ever","body":"Can’t even open it once, Iam using iPhone X, hire the new program group","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5638471077","version":"2.5.4","date":"2020-03-09T20:37:33.000Z","authorName":"Sonu369","rating":1,"title":"Ridiculous!","body":"Never works, period! \nOver the air signal is not being sent to the car and they have my vehicle at the dealership for over two weeks now and it’s not fixed yet. There is a lot that needs to be done here, don’t even think of mbrace or Mercedes me for now.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5629666730","version":"2.5.4","date":"2020-03-07T18:51:35.000Z","authorName":"Dybertron","rating":1,"title":"Not even worth downloading","body":"Okay, I downloaded this app because my brothers and I thought it would be better than to keep asking my mum for the keys every time she shops at a busy mall and we want to wait in the car. \n\nThe number one reason I hate this app so much is how long it takes to even load anything when I start the app. I have 5G E which should be perfect enough to load it but no, not even 10 mins later this app still hasn’t loaded. \n\nNumber Two is my god, the requirement for gas. I’m sorry if my mother or I forget to refill the car but come on, above 50% for gas in order to get it started, you got to be joking me. \n\nNumber three goes with number one and i hate it the most when I have to start the car during a cold day. The car doesn’t even start and takes forever for the app to either do nothing or give you some dumb message like you don’t have enough gas. Having the key on me to start the car is way faster than using this stupid app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5625736652","version":"2.5.4","date":"2020-03-06T23:15:29.000Z","authorName":"original mor","rating":1,"title":"Mercedes Brand Deserves Better","body":"Very disappointed in Mercedes. The prior Mercedes Me app worked perfectly. This version seldom loads and when it does reacts very slow to commands. \n\nMercedes should not have released until the app was perfected. Cars in this price range and with the Mercedes brand deserve better.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5612167825","version":"2.5.4","date":"2020-03-03T20:28:56.000Z","authorName":"Amicperlo","rating":1,"title":"Very unreliable","body":"Works one minute and is down for hours the next.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5608572347","version":"2.5.4","date":"2020-03-03T01:31:13.000Z","authorName":"PlatinumJR","rating":1,"title":"Don’t waste your time","body":"Junk.  They should really do away with this app. It’s garbage.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5607697705","version":"2.5.4","date":"2020-03-02T20:10:37.000Z","authorName":"Alphashalosh","rating":1,"title":"A shame to carry the Mercedes brand to this application","body":"This application launches once in 20 tries.\nVery unreliable !! Do not recommend !!\n\nSam Shito","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5606744952","version":"2.5.4","date":"2020-03-02T14:27:08.000Z","authorName":"Mellader","rating":1,"title":"App Crashes Every Time I Open","body":"I’d love to be able to review this app, but I haven’t been able to use it. It allowed me to register and create a pin, but then crashed. I’ve reinstalled it a number of times but the same thing continues to happen: I open the app, it loads for a couple of seconds, then crashes. I have an iPhone 11 so it can’t be that my phone doesn’t support the app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5603287702","version":"2.5.4","date":"2020-03-01T20:40:29.000Z","authorName":"Lorenzo-LA","rating":1,"title":"Crashes","body":"I just bought a Mercedes and want to sign up for this app. I uploaded my log in info and the app asked for a PIN. After inputting my PIN the app crashes. I deleted the app and re-downloaded the app 3x, but same issue.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5602484612","version":"2.5.4","date":"2020-03-01T16:07:11.000Z","authorName":"sillyappdontbewack","rating":1,"title":"App won’t load or open","body":"This app closes itself every time I open it. This is absolutely terrible. If I could give it zero stars I would.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5600305473","version":"2.5.4","date":"2020-03-01T06:15:39.000Z","authorName":"DocMDDDS","rating":1,"title":"Unacceptable.","body":"In short, this app will deter me from purchasing Mercedes again.  \n\nTo summarize, remote access to your Mercedes is sporadic incredibly unreliable... which essentially renders it useless.  You simply cannot depend on it to work.  Remote start, remote lock, remote unlock, transmitting navigation data from the app to the car - all if it works only sporadically.  And there is simply no rhyme or reason to the error messages.  “Technical error”.  “Communication could not be established”.  “Your vehicle could not be reached.”  “Your request could not be processed...”.  It’s a wheel of fortune of error messages, none of which tell you what the actual problem is.\n\nFor cars costing this much, this is simply unacceptable.  And clearly, Mercedes has no interest whatsoever in fixing it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5599001525","version":"2.5.4","date":"2020-03-01T00:01:34.000Z","authorName":"Chop44567","rating":1,"title":"Crashes immediately upon opening","body":"App immediately crashes on iPhone X","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5598586753","version":"2.5.4","date":"2020-02-29T21:37:46.000Z","authorName":"Jmann4","rating":1,"title":"Never works","body":"About 85% of the time the app is either Uber maintenance or just doesn’t work. Ridiculous for for a mobile app to start your vehicle","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5597120855","version":"2.5.4","date":"2020-02-29T14:00:23.000Z","authorName":"Jimmiose","rating":1,"title":"Terrible","body":"This will not work if it’s hot or cold outside.  You will get frustrated.  You will go outside and put your left hand on the brake peddle and right hand in start.  Bent over with your butt in the air!  Then you go back inside.  This app works at best 1 out of 50.  Once in the winter and maybe once in the summer.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5595004682","version":"2.5.4","date":"2020-02-29T03:40:42.000Z","authorName":"Roccy 515","rating":1,"title":"Crap","body":"I cannot tell you enough of how CRAPPY this app is!!  I can’t log in AT ALL!!  It’s crashes as soon as you open the app!!  c’mom MB, you guys gotta do something about this!!  This is making you guys look REAL bad as a major global luxury auto corporation!!  🤬","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5591930316","version":"2.5.4","date":"2020-02-28T11:57:51.000Z","authorName":"Ajahmarie9289","rating":1,"title":"Pointless App","body":"I hate giving bad reviews but this app is completely useless. You never know if it is going to work. It seems as if every time the weather is freezing and I go to start my car using the app it is down and not working. It is unreliable and infuriating that I pay so much money for a vehicle that has such a poor app design and connection. I have seen better apps by other car brands.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5591817849","version":"2.5.4","date":"2020-02-28T11:27:47.000Z","authorName":"Samuelvimalraja","rating":1,"title":"Worst apps from Mercedes","body":"This app doesn’t even load . Crashes immediately. For a big brand like Mercedes this is totally unacceptable to have an app like this. A college student would have a better app and coding knowledge than the Mercedes app developers.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5589377333","version":"2.5.4","date":"2020-02-27T22:58:25.000Z","authorName":"Pmakercuba","rating":1,"title":"Worthless","body":"It doesn’t work. I’ve struggling with this for a month.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5588786295","version":"2.5.4","date":"2020-02-27T19:13:55.000Z","authorName":"KSoul2177","rating":1,"title":"Awful - rarely works","body":"Rarely works... $60k + car and can’t get bloody App to work.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5587846043","version":"2.5.4","date":"2020-02-27T13:56:23.000Z","authorName":"Chucksooner","rating":1,"title":"Doesn’t work...","body":"I bought a new Mercedes yesterday and downloaded this app. It looks like a great feature...if it worked. It crashes on startup —every time. \n\nWhen will this be fixed?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5587469583","version":"2.5.4","date":"2020-02-27T12:17:15.000Z","authorName":"Jallen476","rating":2,"title":"Not reliable at all","body":"I don’t like putting negative energy out there but I’m hoping the developers pay attention to these reviews... This app fails to load entirely at least once each week. For a couple weeks I kept getting random alerts that my vehicle was unlocked asking me if I wanted to lock it, when I’d check the vehicle was in fact locked but for some reason the app didn’t acknowledge that. At times this disrupted my ability to remotely start my car. \nI have been a loyal Mercedes customer for almost 30 years. I know they’re not typically the leader in comfort design engineering when it comes to inkvative technology however by the time they adopt the “new tech” they’ve usually debugged it pretty well. Unfortunately it doesn’t feel good when a friend can start their Hyundai or Jeep more reliably from the remote to preheat their car in the harsh winter cold than I can having spent almost twice the dollars on a similarly sized vehicle. I may actually look elsewhere when this current lease term is up. That’s how discouraging this experience has been since they brought out the app. Don’t even get me started on the lack of use of their watch app. That’s horrible.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5586936813","version":"2.5.4","date":"2020-02-27T10:06:10.000Z","authorName":"TravelRCW","rating":1,"title":"So disappointing","body":"This app is sad!!!  Only turns car ON maybe one out of ten times if lucky. Have called concierge many times and still have problems. Driving your flagship S Class should be a satisfying experience, but it’s not and Mercedes is failing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5584393276","version":"2.5.4","date":"2020-02-26T20:22:36.000Z","authorName":"WozzaSa","rating":1,"title":"A waste of Time","body":"You would think that a company selling $100k + cars could get a service like this putting like a 63 amg. Think again!!!! If their cars were like this service, the cars would be in for service more often than they would be on the road. \n\nGet your act together Mercedes, this service is not that difficult to get right!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5583500404","version":"2.5.4","date":"2020-02-26T14:54:55.000Z","authorName":"explife153","rating":4,"title":"Convenient","body":"I love that the app makes it so easy to access my financing.\nThe security that comes along with being able to make sure my vehicle is locked is great as well.\nI have experienced a handful of times that the app just would not load or would not perform the task I was choosing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5582395426","version":"2.5.4","date":"2020-02-26T09:44:39.000Z","authorName":"7BenzLady","rating":1,"title":"Unusable","body":"This app absolutely will not open on my phone. There is no tech support. Worthless!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5579058820","version":"2.5.4","date":"2020-02-25T14:42:43.000Z","authorName":"Col Morgan","rating":4,"title":"Tedious to use","body":"It’s nice to have an app with information about all of the functions and features of the car... mostly. After reading the massive owner’s manual, I downloaded the app to my smart phone thinking it would be quicker to navigate through the manual electronically than turning pages in a book. Not so. I discovered the electronic version is very tedious to use. All of the information is there but the app doesn’t have a search feature that will take you directly to the information you need. Great idea but the result is not user friendly.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5578349049","version":"2.5.4","date":"2020-02-25T11:23:57.000Z","authorName":"Joshparekh","rating":1,"title":"Again. You area a multi billion dollars company","body":"Just fix this. This is like the nth time reviewing after every six months. It’s freezing outside and can’t get this car to start remotely. \n\nFix the app so the car can work or fix the car so the app can work.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5575569515","version":"2.5.4","date":"2020-02-24T19:28:03.000Z","authorName":"JoiseyDude","rating":1,"title":"Absurdly difficult to set up correctly","body":"After several calls to mbrace and to the Mercedes me people, in addition to one trip to the dealer, and app still does not recognize my car, I can only say the people behind this app do not live up to the Mercedes Benz quality standard.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5574511258","version":"2.5.3","date":"2020-02-24T13:10:48.000Z","authorName":"Hoosier'87","rating":1,"title":"Ouch...","body":"I wish I could complain about the remote start not being reliable.  Thing is, I can’t even get that far. App crashes on startup every time - on two different devices even!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5572816422","version":"2.5.3","date":"2020-02-24T04:38:37.000Z","authorName":"xelok","rating":2,"title":"Crap app!","body":"They should be ashamed!!! They invented automobile but can’t make a working app??","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5572741782","version":"2.5.3","date":"2020-02-24T04:12:08.000Z","authorName":"mynameisjohn123","rating":1,"title":"Horrible App.","body":"The original version worked so much better. The new app used to work, then I lost sending destination to car, and now the app just shows nothing... for car information. The app can’t even find my location... Good thing the Mercedes Application team doesnt build cars...","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5572297496","version":"2.5.3","date":"2020-02-24T01:48:09.000Z","authorName":"Michael Schoobie","rating":2,"title":"Poor","body":"App is beyond poor for a company that is known to be engineered like no other car in the world.  Remote start works less than 10% of the time.  Called today and was informed App is down due to it being updated — uninstall it, then re-install tomorrow.  Real nice when it’s 0 degrees outside.\n\nDepends on the weather 50% operates, 50% it doesn’t —- should operate flawlessly.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5572148007","version":"2.5.3","date":"2020-02-24T01:02:26.000Z","authorName":"Frugal McDougal Two","rating":1,"title":"It crashes","body":"Can’t open the app at all. Crashes at startup. Looking forward to fixes so I can give a better review.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5568685867","version":"2.5.3","date":"2020-02-23T05:45:47.000Z","authorName":"bibubibuseattle","rating":3,"title":"Performance","body":"The remote start won’t start sometimes, especially during cold season.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5568138799","version":"2.5.3","date":"2020-02-23T02:41:11.000Z","authorName":"goldilocks1953","rating":3,"title":"Okay","body":"The app would be good but it’s too inconsistent. \nWhen I go to lock or unlock my car, I have to move closer to the building that I left. WiFi needs to be nearby. So, you could get locked out. Be careful. Mbrace is another nightmare in itself, charging me for something that the trial hasn’t even begun. Whatever.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5567265839","version":"2.5.3","date":"2020-02-22T21:26:48.000Z","authorName":"The Benz Man","rating":5,"title":"Works like a charm","body":"The Mercedes Me app works well and I haven’t had any problems with it.\nThe key to its reliability is that you need to have a strong wi-fi signal, if your signal is weak then you need to buy a signal booster and your problems will disappear.  The softwares has almost nothing to do with wi-do issues in general.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5561266440","version":"2.5.3","date":"2020-02-21T13:22:47.000Z","authorName":"noe4elle","rating":1,"title":"Worthless - cannot even log in to the app","body":"I’ve tried loading and unloading the app a dozen times now and it crashes before I ever get to the home screen. Without it, I cannot use remote start at all since it is not a fob option and I cannot set up paperless billing and autopay. Reading the comments, this is a known issue, so am baffled as to why Mercedes doesn’t fix it.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5557959496","version":"2.5.3","date":"2020-02-20T19:59:31.000Z","authorName":"David_R","rating":1,"title":"Competitors are much better","body":"Update 02/20/20: Hey, look, another finance update!  What a horrible disappointment this app has proven to be. \n\nPoor list of features compared to competitors. Updates focus only on corporate needs (manage your finance account!), rather than user-facing features (how about gas, oil and tire levels with notifications?).","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5553685229","version":"2.5.2","date":"2020-02-19T20:19:56.000Z","authorName":"Kittyblingbling","rating":3,"title":"No remote start","body":"The ap is stable for me but I don’t understand why, when the capability exists, it is not allowed to be unlocked for my car to have remote start. \nI am paying the Mercedesme yearly subscription and for less money I can have an aftermarket ap based remote start. \nIf there was a waiver or disclaimer needed to be signed, I would not hesitate for a second to sign it and get that remote start. \nWith the current situation, I’m going to terminate this at the next subscription and switch to the aftermarket remote start service. \nAlso, I can never understand why the Mercedesme service cannot include towing for a fee. \nHave the concierge level subscription include towing. \nWhy not?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5553302834","version":"2.5.2","date":"2020-02-19T17:39:19.000Z","authorName":"msgreenneyes","rating":1,"title":"I can’t believe how terrible this app is","body":"They really need to get it together because half the time this app doesn’t even work. The other half only like 2 functions work. The remote start NEVER works. It’s just all terrible.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5539650615","version":"2.5.2","date":"2020-02-16T14:49:52.000Z","authorName":"زيد البركه","rating":5,"title":"Good app","body":"Very helpful specially with snow time","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5532640673","version":"2.5.2","date":"2020-02-15T02:45:27.000Z","authorName":"larzl","rating":1,"title":"Worst customer service ever","body":"Completely worst customer service I have ever had.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5530112689","version":"2.5.2","date":"2020-02-14T12:09:44.000Z","authorName":"kennear1972","rating":1,"title":"The reason I will never buy a Mercedes again","body":"I love my Mercedes  but I live in Wisconsin so remote start is pretty important . It is now below zero and snowing and my app is not working AGAIN !!! \nThis app is the reason I will never buy a Mercedes again . They told me when I bought this one the app was fixed and they lied . It  still doesn’t work ..","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5527959018","version":"2.5.2","date":"2020-02-14T01:18:44.000Z","authorName":"HK3456","rating":1,"title":"Worst app ever","body":"This app never works, seriously it’s a total joke. Maybe it’s Mercedes way of stating the car has remote start but not really offering remote start. If I could give it zero stars I would. NEVER use the lock/unlock feature. You will be locked out of your car when the app is down(which is OFTEN).","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5527897810","version":"2.5.2","date":"2020-02-14T01:00:01.000Z","authorName":"Hieeeeeeeeeeeeeeeee","rating":1,"title":"Worst app ever!!!","body":"Can never connect & if I do it doesn’t recognize my car ...\nCan’t make a payment!\nThis is so frustrating and a waste of time... I have reinstalled it several time...waited for long loading times and still not working! This is over several months and phone calls. \nYou would think they could design a simple app for payments!\nNot satisfied","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5527312776","version":"2.5.2","date":"2020-02-13T21:13:48.000Z","authorName":"bmbogie01","rating":2,"title":"Remote Start","body":"Is Mercedes doing anything to fix the “technical issue on their end” to enable remote start feature to work?  It is virtually useless.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5527190962","version":"2.5.2","date":"2020-02-13T20:19:11.000Z","authorName":"Jwolffw","rating":1,"title":"This app s-cks!","body":"This is an incredibly bad experience and Mercedes should be embarrassed! The one silver lining is how entertaining these reviews are. I guess misery loves company is so true.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5525928038","version":"2.5.2","date":"2020-02-13T13:11:26.000Z","authorName":"Philip Bafaro","rating":1,"title":"Horrible App","body":"This app is trash. It never works. I live in the Midwest and it’s currently 20 degrees and the remote start won’t work. So sad that a 70,000 dollar car has no option that works to remote start. I won’t be buying another Mercedes after this lease because if it. RangeRover here I come. Their app actually works.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5515809796","version":"2.5.2","date":"2020-02-11T06:15:15.000Z","authorName":"unhappy MB owner","rating":1,"title":"Negative review","body":"Like so many other reviews I have read regarding this app, I have to agree- it’s operation is quite poor. Too many times when I am leaving work, I get an error message to try again later or that it is down for maintenance. Soon my free trial will be expired and I will have to pay for the privilege of not being able to remote start my car at a time of day when the ambient air temperature is at it’s coldest. I’m not looking forward to having to continually call and complain or to try and get a credit for paying for something that doesn’t work. With so many negative reviews, makes me wonder if the developers ever read them? So many people complain about the same issues and have been for several YEARS. When will the faults be addressed and corrected?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5506333887","version":"2.5.2","date":"2020-02-09T02:10:13.000Z","authorName":"11Kim11","rating":5,"title":"Loving it so far.","body":"I’m new to the App so I need to say that I’m finding it extremely easy to use.  It’s doing everything it says it should be doing.  No complaints.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5504442097","version":"2.5.2","date":"2020-02-08T15:13:53.000Z","authorName":"Snoopy1888","rating":3,"title":"Mercedes Benz Fan - not so much for the app","body":"It’s hit or miss. Love my Benz. Despise the app. Unpredictable. Logging in is hit or miss. The odds are 1 in 2 to connect. Once in, it’s great. Mercedes, please fix this. Their motto: the best or nothing. The car is the best. The app- nothing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5504029574","version":"2.5.2","date":"2020-02-08T13:22:21.000Z","authorName":"Luciano \"The Rock\" Raus","rating":1,"title":"Awfully awful","body":"The app description says “let’s you manage your Mercedes, from scheduling service...” pause there for a minute and actually try to do it. I did and it doesn’t work. I literally go to the service dealer at date and time and although I have the confirmation code my name is not in the system. This app is WAY WAY subpar to what MB is in terms of product quality and MB needs to understand that in this day and age the two (car and tech) can not be two different things. VERY DISAPPOINTED. One star only because I can start my car remotely, and that’s basically it for this app. GM/Cadillac has a better tech than this. #shameful","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5497426057","version":"2.5.2","date":"2020-02-07T01:26:31.000Z","authorName":"M a ri56","rating":2,"title":"Junk","body":"Never works.  \nNothing.\nCustomer service is a waste of words and time.  I have spent HOURS on the phone with. customer service and stil doesn't work.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5497051709","version":"2.5.2","date":"2020-02-06T23:03:52.000Z","authorName":"JohnnyVega$","rating":1,"title":"Cannot Update","body":"So I guess I should have read the reviews before purchasing my car. I cannot believe Mercedes drops the ball like everyone talks bout in these reviews. I cannot even add my vehicle. I purchased a 2016 AMG GL 63. When I called Mbrace they told me I needed an update and, the dealership needed to do it. I went in and paid $199 for an update even though the vehicle should have had 5 years Mbrace service. I tried to connect after leaving the dealership and Mbrace said it takes a week for the update to show up in their system. A week? Did I just purchase a Honda or a Mercedes? I guess I shouldn’t be in a hurry just to connect an app that according to the reviews doesn’t work anyways. That’s just ridiculous. I’ll update as time goes by.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5495756532","version":"2.5.2","date":"2020-02-06T14:56:32.000Z","authorName":"E4004matic","rating":1,"title":"Garbage!!!","body":"When you want it to work it won’t..... 27degrees this morning and couldn’t even start my car to warm it up a little!  It’s down more than it is working....... just put the start on the remote already!  Never had this problem with my FORD!!! Step up your game Mercedes!!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5489301947","version":"2.5.2","date":"2020-02-05T02:43:01.000Z","authorName":"mwrmaid","rating":1,"title":"Spinning wheel of death","body":"This app is forever loading.... someone could’ve stolen my car and drive it across the country before it actually loaded. FIX IT!!!!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5485446076","version":"2.5.2","date":"2020-02-04T03:51:32.000Z","authorName":"mbarvo","rating":4,"title":"Could be better","body":"Overall the app works but with today's high performance systems and devices it takes extremely long to load.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5480324800","version":"2.5.2","date":"2020-02-02T20:40:14.000Z","authorName":"whossat","rating":1,"title":"Won’t add the vehicle.","body":"Won’t add the vehicle. Won’t lock the car. Won’t do what it’s supposed to do. What’s the point?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5475602952","version":"2.5.2","date":"2020-02-01T17:50:38.000Z","authorName":"drobin2190","rating":3,"title":"Hit and Miss","body":"Sometimes this app works well but sometimes it does not. I wanted it mainly to remote start my \ncar , but sometimes it works and sometimes it doesn’t.  That’s so annoying. \n\nBut other than that it’s worth having. I suppose because you can lock and unlock doors.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5474529294","version":"2.5.2","date":"2020-02-01T12:42:23.000Z","authorName":"darrylerich","rating":1,"title":"How is this app this bad!??","body":"I can’t seem to quite understand this. Mercedes is cream of the crop; the app design is beautiful HOWEVER none of the functions work! It is a hit or miss on remote start, unlock feature, or send2benz. Mercedes please fix or update this app. Can’t believe this type of representation of the company has been released to consumers. Please fix, get it together guys.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5471429166","version":"2.5.2","date":"2020-01-31T19:04:54.000Z","authorName":"BrandonChristian","rating":1,"title":"Really displeasing","body":"I know Mercedes hasn’t been the best at incorporating apps into their interface and day to day uses... but this app is just not it.\n\nThe app freezes and the remote buttons need to be pressed multiple times before it works..\n\nSEND 2 BENZ DOES NOT WORK ON 15-16’ C300.\nMercedes made me pay for Mbrace services ($350) est. and I basically got robbed and was not able to even get GPS directions sent to my BENZ. It’s not a very luxurious experience and rather frustrating when you live an on the go lifestyle or just want easier travel. \n\nAlso there aren’t EVER any special offers on the offers tab.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5467019312","version":"2.5.2","date":"2020-01-30T16:49:00.000Z","authorName":"el-teee","rating":4,"title":"Used to work poorly but works good now","body":"This app used to work poorly for me but has been fairly consistent and working well. The addition of siri voice commands has definitely added a cool affect if you ever want to brag a feature off to someone. \n\nFeature request for siri, is that she responds back the name you choose in your profile instead of the car model number in the database. Right now she says \"Mercedes me connect says it has successfully sent a signal to c3004a\". My car's profile name is Benzito baby so I think it would sound cooler if siri said she started my Benzito babyyy lol.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5462496678","version":"2.5.2","date":"2020-01-29T13:24:34.000Z","authorName":"Feroz97","rating":1,"title":"Verifying vehicle/update","body":"I bought my car on the 28th of October in 2019 certified pre owned and they never got the app to work for me till this day I give up. Probably not going to be looking to purchasing another Mercedes till they get issues sorted out","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5461736039","version":"2.5.2","date":"2020-01-29T09:17:00.000Z","authorName":"Asubra","rating":1,"title":"Sorry cannot accept the EULA","body":"The license agreement blatantly talks about processing and using the user’s personal data on the mobile device e.g. the contacts and other personal info even. Where would this info be transmitted? How will it be used? No explanation. Sorry cannot install this app. This is almost like malware. Why would you steal user data?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5460433432","version":"2.5.2","date":"2020-01-29T00:35:59.000Z","authorName":"Roadkinghi","rating":3,"title":"Slow","body":"Finding location of the vehicle is real slow.\nTravel zones won’t setup as there’s a technical error.\nHum works better.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5459433711","version":"2.5.2","date":"2020-01-28T17:21:31.000Z","authorName":"Maddie8888","rating":1,"title":"Inaccurate, unreliable","body":"Remote start has about 30% chance of working. I have photo of locked doors after message reporting remote start failed because the doors are unlocked. That’s just one of the many messages returned when trying to use. In general, it has stupid slow response time in all that it does. Once however, the app unlock screen was the ONLY way I could open the vehicle’s doors. The handles wouldn’t open and the key fob itself wouldn’t open them.  Between app bugs & the vehicle’s other myriad electronic glitches, this 2020 may be going back. Thankful for camera phone that is helping me document all of these.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5455337222","version":"2.5.2","date":"2020-01-27T14:58:07.000Z","authorName":"Tymiata","rating":3,"title":"Remote Start","body":"The   Remote Start is a failure. The app just does it graphics function to make you believe it is working, then, no start. \nA year ago the function worked very good. I updated the app and all was well, now is back to not working.\nAnnoying","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5447441770","version":"2.5.2","date":"2020-01-25T15:06:09.000Z","authorName":"Djd91","rating":2,"title":"How is it this bad?","body":"If it works it’s simply ok. 2 or more days a week it just won’t even open. Another 1 day a week is maintenance, all day. It’s a joke. Especially from Mercedes-Benz. Aren’t you guys embarrassed by this?","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5444783822","version":"2.5.2","date":"2020-01-25T00:17:26.000Z","authorName":"Angoolak","rating":1,"title":"Attempted to activate my account 4 TIMES","body":"Was told to wait for 48 hours for the activation and every darn time I get told that there is nothing about me in their system and get asked about my info again and again. Terrible service. No way in hell I would pay for this garbage after it’s trial period.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5440643810","version":"2.5.2","date":"2020-01-23T23:51:16.000Z","authorName":"MCPS parent","rating":2,"title":"Mercedes should be 5 Star but Not","body":"I think the app is easy to use and has a great design, but every time I try to actually use the app...nothing.  It never works on the first time. Have to try over and over and over to even load the app!  Come on.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5439190350","version":"2.5.2","date":"2020-01-23T14:36:56.000Z","authorName":"KT diner","rating":1,"title":"I am tired of the error message “up and running soon”","body":"I have not once gotten into app. Every time I try I have to watch the intro spin and then the waste of time messsge... “sorry for the inconvenience we will be up and running soon”","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5438704180","version":"2.5.2","date":"2020-01-23T12:15:56.000Z","authorName":"Jrsitstitxlhxlyxotsitw","rating":1,"title":"Only app that doesn’t ask to rate it","body":"Because they don’t want you to! So disappointing the remote start is really the main feature you’d want to use and whenever it’s cold and you try to use it there is a “technical error” or “down for maintenance.” Total bs.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5436715659","version":"2.5.2","date":"2020-01-22T23:41:55.000Z","authorName":"______TOR______","rating":1,"title":"Just found out they are still billing me from a lease that ended 2 years ago","body":"Unbelievable. The vehicle could not even be seen in the mbrace portal or app...","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5436393662","version":"2.5.2","date":"2020-01-22T21:28:08.000Z","authorName":"NYR Subscriber","rating":1,"title":"New car same bad pp","body":"The colder it is the higher the chances hoo can’t connect.\n\n30 Fahrenheit means 0% probability of app working.\n\nIt is embarrassing..\n\nFeb 19, 2019 - it does seem like the work they have done has improved performance.  This morning I was able to easily log in and use remote start.  I am increasing my review by 1 star.\n\nJan 31, 2019 - 3 degrees F.  App no longer has remote start on it.\n\nJan 21, 2019 - 7 degrees F.  Logging into app took 15 min.  After 3rd try remote start worked.\n\nThere should be a class action law suit against MB for this.  We paid for a feature that rarely works.\n\nSo much for the remote start.\n\nAn utterly awful app.  Most times cannot log in.  I have seen and has to agree to the terms of service 3 times today and neither the app nor the terms have changed.\n\nEventually when you do login, remote start NEVER works.\n\nI am sure Kia does a better job.\n\nWhoever is responsible for the ownership of this app should be embarrassed.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5427550874","version":"2.5.2","date":"2020-01-20T14:32:33.000Z","authorName":"RhonB2424","rating":2,"title":"Worthless","body":"Never works . The most  frustrating piece of garbage ever. All I want is for my car to start remotely..Is that too much to ask? \nYes, apparently it is wayyyy too much to ask.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5424029371","version":"2.5.2","date":"2020-01-19T16:47:11.000Z","authorName":"scfefgh","rating":2,"title":"Remote start","body":"Only reason I use The app so I can  use the remotes start and it dose not work most of the time . Especially when I really need  it to work . It’s been that way for two years I do not know why Mercedes has now fixed this","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5423173871","version":"2.5.2","date":"2020-01-19T12:41:01.000Z","authorName":"Lv023","rating":1,"title":"The worst App of all time","body":"Never reliable. Works maybe 10% of the time. This app is a complete joke and it seems like on the coldest, snowiest days, it without fail, will glitch or give some ridiculous error message.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5415617833","version":"2.5.2","date":"2020-01-17T16:09:57.000Z","authorName":"Nanfw","rating":1,"title":"Useless","body":"No point in enumerating the problems with this app since it has been done many times already. \n\nMB should not offer a technology in which they do not believe or support. (The MB financial services app works just fine)","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5408840948","version":"2.5.2","date":"2020-01-16T01:30:18.000Z","authorName":"Sunnyk1234","rating":1,"title":"Featureless crap","body":"I expected so much more from Mercedes than this third grade app! My Subaru app has more features such as temp set, heated seats steering wheel options than this! Please seriously consider pulling this out of the App Store and start over for god sake!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5407600602","version":"2.5.2","date":"2020-01-15T17:13:08.000Z","authorName":"t3texas","rating":5,"title":"Mercedes Me","body":"We have used the app for 2 years now, and our only complaint is that there are occasions when we can’t connect.  Once or twice , I had my dog in the car and couldn’t connect to unlock it.  I had full phone service, but had to call Mercedes to get my car unlocked.  When it works it is great!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5407500106","version":"2.5.2","date":"2020-01-15T16:36:10.000Z","authorName":"Chadburns","rating":2,"title":"Frustrating at Best","body":"I rarely write negative reviews about anything because it isn’t worth the energy to me to be “that guy”, but I don’t have a choice with this app. I gave it 2 stars because I think the app itself (design, interface, features) warrant 4 stars, but the reliability and functionality of the service itself is laughable at times. If I were to quantify, I’d guess that 1 of 10 attempts to use the app either to start or just unlock my car will not even open or load. It will randomly log out for no reason, and the “service is temporarily unavailable” or “system is down for maintenance”. \n\nIt’s clear to me that the architecture of the software is fundamentally flawed rendering it unreliable. Imagine if 1 of 10 text messages you tried to send failed and you had to try again later?\n\nMy hope is that Mercedes directs some resources to scrapping this and rebounding from the ground up because they really should be leading the automotive industry in technology, not lagging behind like they are.","voteCount":8,"voteSum":6,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5404080373","version":"2.5.2","date":"2020-01-14T21:30:56.000Z","authorName":"Phil023","rating":1,"title":"Lousy app!!  Doesn’t work","body":"I installed this app shorty after I got my new Mercedes. It worked initially and now doesn’t work at all. I can’t unlock or remotely start my vehicle at all. Support tech has no solution for me. It should work especially for a luxury vehicle.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5403718380","version":"2.5.2","date":"2020-01-14T19:20:18.000Z","authorName":"bcn visitor","rating":1,"title":"This is awful","body":"This app is terrible— hard to use, inconsistent, unreliable and poorly designed and implemented. If the cars were this bad Benz would be out of business. So much promise and such a disaster","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5398243297","version":"2.5.2","date":"2020-01-13T11:34:57.000Z","authorName":"teelexus","rating":5,"title":"I love it","body":"I’ve had the app for over 8 years or longer. It’s very convenient,  I’m able to unlock my car without my keys, start my car In order to warm up when it’s cold. Make payment etc. I like the concierge service .","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5395824139","version":"2.5.2","date":"2020-01-12T20:48:27.000Z","authorName":"jaebricnr","rating":1,"title":"Worst Auto App Ever","body":"I bought a 2019 E53 AMG and ended up returning it because the app was so horrible.  I got so many fake notifications saying my doors were unlocked or that my windows were down, when neither was the case.   The auto start would barely work and half the time when I plugged my phone in, I got an error saying the Data was full so it wouldn’t work.   I can’t believe Mercedes actually has this app still active, it completely ruins the driving experience.  All of horror stories about this app are true, I would steer clear of Mercedes Benz.  Most every other car brand has a functioning app these days, this is the biggest piece of crap of all time.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5395262696","version":"2.5.2","date":"2020-01-12T17:39:08.000Z","authorName":"t-money-eq-eaza","rating":1,"title":"App is always down","body":"I like the app, when it’s working. It’s down about half the time I try to use it. Seems like they should be able to fix that.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5392868927","version":"2.5.2","date":"2020-01-12T05:06:24.000Z","authorName":"Vader26","rating":1,"title":"Really Needs Work","body":"Really disappointing how unreliable this app is. I was so excited to finally have remote start back after selling my 2008 Cadillac for a 2010 e350. Now I have a new e300 and the remote start works maybe 20% of the time! Very frustrating. Why is it my 08 Cadillac had remote start built into the key and worked every time, but my 10 year newer Mercedes rarely does? Developers, please work this out! I see the newer Mercedes have a different app, which is likely a sign they are starting from scratch and will abandon this piece of software and thus leave us “older” car owners in the dust. One star since it works 20% of the time.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5377703960","version":"2.5.2","date":"2020-01-08T19:47:41.000Z","authorName":"367833478","rating":1,"title":"Worst customer service ever","body":"I purchased a 2016 GL450 $90,000 car in 2016. Downloaded the app and spent 3 months calling Mercedes and going to the dealer trying to get it to work. Mercedes says this is a common problem and may take a few more months, keep calling to check and see if it works yet. Now after 3 months they tell me that even if they get the app to work the car is not capable of remote start. I’ll never buy a Mercedes again. Cadillac all the way.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5377150863","version":"2.5.2","date":"2020-01-08T16:27:19.000Z","authorName":"Frankver@","rating":1,"title":"Un reliable app","body":"It’s cool to have a MB app but it never works. I wonder what’s going to happen if one day I really need to use to open my car for an emergency or to locate my car.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5376816876","version":"2.5.2","date":"2020-01-08T14:46:42.000Z","authorName":"Drewrite","rating":5,"title":"Works!!","body":"After being very disappointing it has actually worked very well the last couple months!!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5373026572","version":"2.5.2","date":"2020-01-07T17:05:51.000Z","authorName":"Kla-Milwaukee","rating":1,"title":"Doesn’t work.","body":"Simply doesn’t work. It’s unbelievable that Mercedes-Benz has such a garbage app. It’s either their satellite or the app or the vehicle hardware or software or ALL OF THE ABOVE. I’ve owned several Ford F-150s for last 8 years and never had this issue. So living in cold Wisconsin and no auto start on the key fob is really sucking right now","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5372841785","version":"2.5.2","date":"2020-01-07T16:02:59.000Z","authorName":"drmrm","rating":1,"title":"Not worth it","body":"Cumbersome, horrible interface makes interacting with any agent you connect with feel like you are on satellite connection to some distant planet! Not clear, fuzzy at times but the real dog about this Mercedes Benz service is that connecting to a live person often takes what feels like decades. When you finally connect to a live person for personal assistance, most of these with whom you interact with are quite ill equipped to handle anything outside of a very, very general question. They can tell you what day it is or the date per se; but, should you ask anything outside of this, good luck, you'll be transferred for the next 20 years to various other departments! Im only in a trial run and it only took 3 calls for me to come to such a drastic conclusion. It's simply horrible.  The competitors GM Onstar is light years ahead of this and Cadillac, here I come!","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5372074246","version":"2.5.2","date":"2020-01-07T12:01:56.000Z","authorName":"Gbryer","rating":1,"title":"They’re apps never work","body":"Had the app for awhile with a decent amount of  bugs, then it just stopped working and wouldn’t connect. The last couple apps by them are like this, they never work and are trash","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5370340603","version":"2.5.2","date":"2020-01-07T01:03:26.000Z","authorName":"MB_AppStore","rating":1,"title":"-5 stars","body":"Absolutely horrific app. Works 20% of the time. Bogus errors “sunroof open” ... “low gas” neither of which are true.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5370295209","version":"2.5.2","date":"2020-01-07T00:45:29.000Z","authorName":"garda753z","rating":2,"title":"Mercedes Me","body":"This application needs some improvement with more flexibility. It currently limits the auto start feature based on the fuel level. It is set at somewhere in the 30% range. They stated that this was done for safety reasons but I really cannot figure this one out. It needs some work. I have also found that it is not very reliable which is disappointing come from Mercedes. I expected more leading edge technology.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5365480334","version":"2.5.2","date":"2020-01-05T19:12:47.000Z","authorName":"gitanya1","rating":5,"title":"amazing","body":"this app is amazing i’m so happy i didn’t listen to the previous reviews the auto start works great just follow the instructions its so convenient especially now that it’s winter","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5365108681","version":"2.5.2","date":"2020-01-05T17:02:36.000Z","authorName":"guccixx","rating":5,"title":"Incredibly convenient","body":"I’ve been using this app since I got my mercedes and I haven’t looked back. This application is super convenient for making your life easier. Would highly recommend downloading and paying for the service. Always room for improvement! Wondering what else they will add in the future.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5362328892","version":"2.5.2","date":"2020-01-05T01:48:01.000Z","authorName":"ZumbaTinkerbell","rating":1,"title":"I wanted to love it but it’s only been disappointing","body":"It’s been my lifelong dream to own a Mercedes. I about one last week and within that time the app has only worked about 2 days. It keeps saying “error, sorry for the inconvenience”. One of the requirements I wanted in buying a new car is that it has remote start. It’s 12 degrees or lower her every morning and then is no way to start it before leaving for work at 6am. VERY disappointed. I’ve deleted and reloaded the 3 times already and it doesn’t work. Also, after reading other reviews theirs have more options that I was able to experience the two days it actually worked. Again, at this moment it says it’s under maintenance - this does not help me with the frigid cold mornings and my children and I having to get in and wait for it to warm up every morning.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"},{"id":"5361772351","version":"2.5.2","date":"2020-01-04T22:28:55.000Z","authorName":"Texan Down Owl's Run","rating":1,"title":"Was Getting Better","body":"The app actually went a couple months of working - other than requiring 5 gal of gas before it will start. Now they have been maintenance if the app for over 24 hrs. Freezing temps outside and no remote start for 2 days...\n\nWhy can’t they start seat warmer and ventilation remotely???","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1132286368","appName":"Mercedes me (USA)"}]