[{"id":"6707835907","version":"2.4.1","date":"2020-12-02T00:59:11.000Z","authorName":"Snicklas","rating":1,"title":"OMG","body":"So bad its insanity.  The germans cannot build an app for this.  One app after another, one circle jerk after another, one phone call after another and still cannot connect to vehicle.  Absolutely miserable.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1434700227","appName":"Mercedes PRO Connect"},{"id":"6539047042","version":"2.4.1","date":"2020-10-15T21:50:57.000Z","authorName":"Love690","rating":1,"title":"Worst app I have ever tried to use","body":"Am shocked this is mercedes.  As everyone else has mentioned... don’t even bother.  Epic fail.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1434700227","appName":"Mercedes PRO Connect"},{"id":"6438727549","version":"2.4.0","date":"2020-09-17T15:36:20.000Z","authorName":"Kwm1951","rating":1,"title":"Fleet admin","body":"After spending hours on the phone with MB finally got everything working then today there was an update to the app. And of course I upgraded. Now just a spinning wheel. The worst experience ever and this is with a major company. Can’t evaluate app as it doesn’t work","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1434700227","appName":"Mercedes PRO Connect"},{"id":"6425927185","version":"2.3.0","date":"2020-09-13T19:06:53.000Z","authorName":"SoCal Diver","rating":2,"title":"Needs work","body":"The app seems to hang when trying to login and I have to delete the app and reinstall to get it working again. This app needs to rearchitected so that it works properly","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1434700227","appName":"Mercedes PRO Connect"},{"id":"6386530345","version":"2.3.0","date":"2020-09-02T07:42:25.000Z","authorName":"Pejvak","rating":1,"title":"It’s a shame","body":"How Mercedes can such an awful app to be published in App Store.\nIt’s all messed up from login part part that keeps redirecting pages all the way their app customer support. \n\nHow is it even possible to be so horrible?! Who did you hire to write your app? A collage student can do better than this.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1434700227","appName":"Mercedes PRO Connect"},{"id":"5794443610","version":"2.3.0","date":"2020-04-11T05:15:16.000Z","authorName":"GLJones","rating":1,"title":"Won’t load on iPhone 11 Pro","body":"App used to work. Now it displays the Mercedes logo and the spinning wait/loading icon. It never loads. I have removed and reloaded the app, rebooted the phone...all the usual things.","voteCount":1,"voteSum":1,"platform":"iOS","appID":"1434700227","appName":"Mercedes PRO Connect"},{"id":"5554534041","version":"2.0.1","date":"2020-02-20T01:43:56.000Z","authorName":"nlaiii","rating":1,"title":"mercedes pro disconnect is what it should be called","body":"how can you write a review for A App that has never worked. bad joke, no one at Mercedes even though there is an app? good luck, 6 months and 8 tech’s, nothing.......","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1434700227","appName":"Mercedes PRO Connect"},{"id":"5379973512","version":"2.0.1","date":"2020-01-09T08:34:48.000Z","authorName":"Philip Coats","rating":1,"title":"Just a joke","body":"Quite possibly the worst app I have ever loaded on my iPhone. \n\nI had no idea this app or this service existed and was supposed to be included with my vehicle  until I got an email from the dealer 6 months after I bought the vehicle. \n\nAfter weeks of trying to get registered - including 4 calls to customer service and 2 visits to the dealership, it’s still not working. \n\nThe registration process is a joke. You need at least 3 different email addresses to register one vehicle.  And you need to login to at least 2 different websites and this app to even get started. \n\nNobody in customer service knows what they are doing. Every time I call them, they assure me that I’ve reached the right person and they promise to solve all these problems and followup with me. Then I never hear from them again and I can never get back to the same person. \n\nThe dealers have no idea what this app is for and no idea how to help you register. \n\nAs best I can tell, the only thing you might be able to do with the app is lock/unlock your doors. But every time I try to use that feature I either get a blue bubble that says “too early” (no idea what the heck that means) or the app crashes. \n\nGood luck if you want to use the app while you are in the vehicle. If it recognizes anybody is even sitting in the front seat (even if you are parked and the engine is off), you can’t get past the “keep your eyes on the road” message no matter how many times you tap the “Passenger” button. \n\nYou would think that you would expect more when you pay $60k for a vehicle, but apparently they have no clue how to run a website or build an app.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1434700227","appName":"Mercedes PRO Connect"},{"id":"5336904071","version":"2.0.1","date":"2019-12-30T01:35:25.000Z","authorName":"isra3107","rating":5,"title":"M","body":"Hola !! Baje la aplicacion pero me pide email y password y no se como inscribirme primero ! Podria ayudarme?? Gracias","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1434700227","appName":"Mercedes PRO Connect"},{"id":"5048584487","version":"1.3.1","date":"2019-10-30T03:09:06.000Z","authorName":"hatamahata","rating":1,"title":"Don’t wast your time!","body":"The app doesn’t work, Mercedes pro costumer service is a joke. Three weeks trying to activate the pro connect services and nothing.","voteCount":0,"voteSum":0,"platform":"iOS","appID":"1434700227","appName":"Mercedes PRO Connect"}]